{
  "Dr. Alex Kalynychenko": "A lecturer at the University of Toronto Mississauga, Department of Geography, Geomatics and Environment, teaching a course on Geographic Information Processing (GGR 321 H5S).",
  "University of Toronto Mississauga": "A campus of the University of Toronto, where Dr. Alex Kalynychenko is teaching.",
  "Spatial Analysis": "A powerful set of methods that can be applied to spatial data to add value to them, to reveal patterns and anomalies that are not immediately obvious, to find solutions for complex spatial problems and support decision-making.",
  "ESRI": "A supplier of Geographic Information System (GIS) software, web GIS and geodatabase management applications. The company is referenced in the context of demos and source material.",
  "Carl Steinitz": "A person who developed a schematic model of the geodesign process.",
  "Longley et al. (2015)": "A source of information, possibly a publication or group of authors, related to the field of geography or geoprocessing, in the year 2015.",
  "ArcGIS Pro extensions": "A set of tools designed to perform various spatial analysis tasks, including 3D analysis, business analysis, geostatistical analysis, image analysis, network analysis, and spatial analysis.",
  "Aristotle": "Ancient Greek philosopher mentioned in the context of known vs unknown limitations.",
  "Machine learning and AI": "A set of data-driven algorithms and techniques that automate the prediction, classification, and clustering of data. Deep learning, a subset of machine learning, uses artificial neural networks to learn from data.",
  "Big data analytics": "The process of examining large and varied data sets to uncover hidden patterns, unknown correlations, market trends, customer preferences and other useful information. In the context of this text, it is associated with ArcGIS Pro tools.",
  "ESRI 2024": "A source of information, possibly a publication or event, related to ESRI (Environmental Systems Research Institute), a supplier of Geographic Information System software, in the year 2024.",
  "Modeling and scripting": "A concept related to the creation of models and scripts, particularly in the context of geoprocessing and programming languages like Python.",
  "Python": "A high-level, interpreted programming language often used for scripting in geoprocessing.",
  "ModelBuilder": "A visual programming language for building geoprocessing workflows in ESRI's ArcGIS software.",
  "Zandbergen (2024)": "A source of information, possibly a publication or author, related to the field of geography or geoprocessing, in the year 2024.",
  "Area-Based Analyses": "A concept in geography and geoprocessing where characteristics are ascribed to entire areas rather than individual points.",
  "Polygon": "A plane figure that is described by a finite number of straight line segments connected to form a closed polygonal chain or polygonal circuit.",
  "Redistricting": "The process of drawing electoral district boundaries in the United States.",
  "Gerrymandering": "A practice intended to establish an unfair political advantage for a particular party or group by manipulating district boundaries.",
  "23rd Congressional District": "A former electoral district in the United States, specifically mentioned in the context of redistricting and gerrymandering.",
  "24th District": "A new, more compact electoral district in the United States, created as a result of redistricting.",
  "Centrality": "A concept in geography and geoprocessing related to the central tendency of a set of points.",
  "Mean": "A measure of central tendency calculated as the sum of values divided by the number of values.",
  "Median": "A measure of central tendency representing the middle value in a set of values.",
  "Mode": "A measure of central tendency representing the most frequently occurring value in a set of values.",
  "Centroid": "The geometric center of a plane figure or shape.",
  "U. S. Bureau of the Census": "The U.S. government agency responsible for producing data about the American people and economy, including the decennial census.",
  "Dispersion": "A measure of how spread out numbers are in a dataset, often represented by the standard deviation or variance.",
  "Standard deviation": "A measure of the amount of variation or dispersion in a set of values.",
  "Variance": "A measure of dispersion that represents the average of the squared differences from the Mean.",
  "RMSE": "Root Mean Square Error, a measure of the differences between values predicted by a model or an estimator and the values observed.",
  "Analysis of Surfaces": "A concept in geography and geoprocessing related to the study of surface characteristics, such as slope, aspect, and flow directions.",
  "DEM": "Digital Elevation Model, a 3D representation of a terrain's surface.",
  "Orange County DEM": "Digital Elevation Model of Orange County, used for predicting river channels.",
  "Santa Ana River": "A river that flows from a gorge and empties into the Pacific near Seal Beach, but in reality, turns south and empties near Newport Beach.",
  "Pacific": "The Pacific Ocean, where the Santa Ana River empties near Seal Beach.",
  "Seal Beach": "A location near which the Santa Ana River is predicted to empty into the Pacific.",
  "Newport Beach": "The actual location where the Santa Ana River empties into the Pacific.",
  "Geodesign": "A design and planning method which tightly couples the creation of design proposals with impact simulations informed by geographic contexts.",
  "Location-allocation problems": "Problems that involve determining where to locate and how to allocate demand to central facilities.",
  "p-median problem": "A problem that seeks optimum locations for any number of central facilities such that the sum of the distances between each weight and the nearest facility is minimized.",
  "coverage problem": "A problem that seeks to minimize the furthest distance traveled by point locations.",
  "Hakimi’s theorem": "A theorem stating that only junctions (nodes) in the network and places where there is weight need to be considered in certain location-allocation problems.",
  "Routing problems": "Problems that involve decisions about the optimum tracks followed by vehicles.",
  "shortest-path problem": "A problem that finds the path through the network between a defined origin and destination that minimizes distance or some other measure based on distance.",
  "traveling-salesman problem (TSP)": "A problem to select the best tour out of all possible orderings of places to visit, in order to minimize the distance (or other measure) traveled.",
  "orienteering problem": "A problem similar to TSP but the objective is to maximize the rewards associated with visiting a selection of the stops while minimizing the total distance traveled.",
  "Sears": "A company whose drivers use a system to schedule and navigate a day’s workload.",
  "Hypothesis testing": "A statistical method that uses information obtained from samples to make general conclusions about a larger population.",
  "randomization tests": "Tests that simulate a large number of random arrangements of the data and offer a good alternative in hypothesis testing.",
  "Santa Barbara": "A location north of which a randomly placed sample of points is used to examine the relationship between vegetation cover class and elevation.",
  "ArcGIS Pro": "A professional GIS application for creating and working with spatial data on your desktop.",
  "Quiz 4": "An assessment to be administered via Quercus next week, covering materials from Week 9&10 Spatial Analysis I&II and recommended readings.",
  "Quercus": "The platform through which Quiz 4 will be administered.",
  "Week 9&10 Spatial Analysis I&II": "The material that will be covered in Quiz 4, possibly a part of a course or study program.",
  "Recommended readings": "Additional materials suggested for study and preparation for Quiz 4.",
  "Lab 3": "A lab session or practical class scheduled for Thursday, March 13, 2025.",
  "Thursday, March 13, 2025": "The date on which Lab 3 is scheduled."
}