{
  "Dr. Alex Kalynychenko": "A lecturer at the University of Toronto Mississauga, Department of Geography, Geomatics and Environment, who is giving a lecture on Spatial Analysis.",
  "University of Toronto Mississauga": "A university campus where Dr. Alex Kalynychenko is giving a lecture on Spatial Analysis.",
  "Spatial Analysis": "A type of geographical analysis which seeks to understand patterns of human behavior and its spatial expression in terms of mathematics and geometry, that is, locational analysis.",
  "ESRI": "A company that provides geographic information system software, web GIS and geodatabase management applications. The lecture includes a demo from ESRI and references to ESRI's resources.",
  "Carl Steinitz": "A person, likely a researcher or professional in the field of geodesign, who developed a model of the geodesign process.",
  "Longley et al. (2015)": "A source of information, likely a publication or report, related to various geographic concepts including redistricting, centrality, and analysis of surfaces.",
  "ArcGIS Pro extensions": "Special tools designed to analyze and create 3D GIS data, analyze market trends, predict the values associated with spatial or spatiotemporal phenomena, interpret and use imagery, measure distances and travel times along a network, find the most suitable locations, and perform various raster-based mathematical operations.",
  "Aristotle": "Ancient Greek philosopher mentioned in the context of known vs unknown limitations.",
  "Machine learning": "A set of data-driven algorithms and techniques that automate the prediction, classification, and clustering of data.",
  "AI": "Artificial Intelligence, a branch of computer science that aims to create systems capable of performing tasks that normally require human intelligence.",
  "Deep learning": "A subset of machine learning techniques that uses artificial neural networks to learn from data.",
  "Big data analytics": "The process of examining large and varied data sets to uncover hidden patterns, unknown correlations, market trends, customer preferences and other useful information. In this context, it's related to transforming large amounts of spatial data into manageable information using ArcGIS Pro.",
  "ESRI 2024": "A source of information, likely a publication or report, related to geoprocessing, Python scripts, and ModelBuilder.",
  "Modeling and scripting": "A concept related to the use of programming and simulation to represent and manipulate data or systems.",
  "Geoprocessing framework": "A structure or set of tools used for processing geographic information.",
  "Python scripts": "Programs written in Python, a high-level, interpreted programming language.",
  "ModelBuilder": "A visual programming language for building geoprocessing workflows in ESRI's ArcGIS software.",
  "Zandbergen (2024)": "A source of information, likely a publication or report, related to area-based analyses.",
  "Area-Based Analyses": "A method of analysis that involves assigning characteristics to entire areas rather than individual points.",
  "Polygon": "A plane figure that is described by a finite number of straight line segments connected to form a closed polygonal chain or polygonal circuit.",
  "Trapezia": "A type of geometric shape, used here in the calculation of area.",
  "Redistricting": "The process of drawing electoral district boundaries in the United States.",
  "23rd Congressional District": "A former electoral district in California, U.S.",
  "24th District": "A current electoral district in California, U.S., known for its compact shape.",
  "Gerrymandering": "A practice intended to establish a political advantage for a particular party or group by manipulating district boundaries.",
  "Centrality": "A statistical measure that determines the center or central tendency of a dataset.",
  "Centers": "In this context, the two-dimensional equivalent of the mean in a dataset.",
  "Centroid or mean center": "The arithmetic mean position of all the points in a figure.",
  "U. S. Bureau of the Census": "The government agency that conducts the United States Census.",
  "Dispersion": "A measure of how much the data values in a statistical dataset vary.",
  "Standard deviation": "A measure of the amount of variation or dispersion of a set of values.",
  "Variance": "A statistical measurement of the spread between numbers in a data set.",
  "RMSE": "Root Mean Square Error, a measure of the differences between values predicted by a model or an estimator and the values observed.",
  "Analysis of Surfaces": "A process of examining the properties and features of a surface, including aspects like slope, travel, watersheds, and visibility.",
  "DEM": "Digital Elevation Model, a 3D representation of a terrain's surface.",
  "2015": "The year mentioned in the source of the text, possibly when the research or analysis was conducted or published.",
  "https://www.travelassociates.com/": "A website URL, possibly related to the source of the text or the subject of the analysis.",
  "Orange County DEM": "Digital Elevation Model (DEM) of Orange County, a tool used in geographic analysis to represent terrain's surface.",
  "river channels": "Natural or artificial watercourses that contain flowing water.",
  "Santa Ana River": "A river in Southern California, United States, which is discussed in the context of its flow and the location where it empties.",
  "gorge": "A narrow valley between hills or mountains, typically with steep rocky walls and a stream running through it.",
  "Pacific": "The Pacific Ocean, where the Santa Ana River is described as emptying near Seal Beach.",
  "Seal Beach": "A coastal city in Orange County, California, where the Santa Ana River is initially predicted to empty into the Pacific.",
  "Newport Beach": "A coastal city in Orange County, California, where the Santa Ana River actually empties into the Pacific.",
  "geodesign": "A design and planning method which tightly couples the creation of design proposals with impact simulations informed by geographic contexts.",
  "location-allocation problems": "Problems in operations research and spatial analysis concerning the optimal placement of facilities and the allocation of entities to those facilities.",
  "p-median problem": "A mathematical problem that seeks the optimal locations for a number of facilities to minimize the sum of the distances between each entity and the nearest facility.",
  "coverage problem": "A mathematical problem that seeks to minimize the furthest distance traveled by entities to a central facility.",
  "Hakimi’s theorem": "A theorem in network theory, used in the context of location-allocation problems, which simplifies the problem by stating that only junctions (nodes) in the network and places where there is weight need to be considered.",
  "routing problems": "Problems in operations research that involve finding the most efficient routes for transportation or communication.",
  "shortest-path problem": "A problem in graph theory that involves finding the path between two nodes that minimizes the total distance or cost.",
  "traveling-salesman problem (TSP)": "A classic algorithmic problem in the field of operations research and theoretical computer science, focusing on optimization. The goal is to find the shortest possible route that visits each city once and returns to the origin city.",
  "orienteering problem": "A routing problem similar to the traveling-salesman problem, but with the objective to maximize the rewards associated with visiting a selection of the stops while minimizing the total distance traveled.",
  "Sears": "A retail company, mentioned in the context of a system used by its drivers to schedule and navigate their workload.",
  "hypothesis testing": "A statistical method used to make inferences or draw conclusions about a larger population based on a sample of data.",
  "randomization tests": "Statistical tests that simulate a large number of random arrangements of the data as an alternative to traditional hypothesis testing.",
  "Santa Barbara": "A city in California, USA, mentioned in the context of a sample used to examine the relationship between vegetation cover class and elevation.",
  "ArcGIS Pro": "A geographic information system (GIS) application for professional desktop GIS work, mentioned in the context of selecting appropriate geospatial tools for spatial analysis.",
  "geodesign principles": "Principles that guide the process of geodesign, a method of design that incorporates geographic information.",
  "Quiz 4": "A test that will be administered via Quercus, covering materials from Week 9&10 Spatial Analysis I&II and recommended readings.",
  "Quercus": "An online platform where Quiz 4 will be administered.",
  "Week 9&10 Spatial Analysis I&II": "The materials that will be covered in Quiz 4, presumably topics from a course or study program.",
  "Recommended readings": "Additional materials suggested for study in preparation for Quiz 4.",
  "Lab 3": "A laboratory session or practical class that is scheduled for Thursday, March 13, 2025.",
  "Thursday, March 13, 2025": "The date on which Lab 3 will take place."
}