{
  "Dr. Alex Kalynychenko": "A professor at the Department of Geography, Geomatics and Environment, University of Toronto Mississauga, who is giving a lecture on Spatial Analysis.",
  "University of Toronto Mississauga": "A campus of the University of Toronto where Dr. Alex Kalynychenko works.",
  "Spatial Analysis": "A set of methods applied to spatial data to reveal patterns, anomalies, and solutions for complex spatial problems.",
  "ESRI": "A company that provides geographic information system software, web GIS and geodatabase management applications. Mentioned in the context of a demo and as a source of information.",
  "Carl Steinitz": "A scholar known for his work in geodesign, a field that combines geography and design.",
  "Longley et al. (2015)": "A source of information, likely a publication or report, related to various geographical concepts including redistricting, centrality, and analysis of surfaces.",
  "ArcGIS Pro extensions": "A set of tools in ArcGIS Pro software that are designed for various spatial analysis tasks, such as 3D analysis, business analysis, geostatistical analysis, image analysis, network analysis, and spatial analysis.",
  "Aristotle": "An ancient Greek philosopher mentioned in the context of known vs unknown limitations.",
  "Machine learning and AI": "Techniques that automate the prediction, classification, and clustering of data. Deep learning, a subset of machine learning that uses artificial neural networks to learn from data, is also mentioned.",
  "Big data analytics": "The process of examining large and varied data sets to uncover hidden patterns, unknown correlations, market trends, customer preferences and other useful information. In the context of the text, ArcGIS Pro includes tools for big data analytics.",
  "Spark": "An open-source, distributed computing system used for big data processing and analytics. Mentioned in the context of the GeoAnalytics Desktop toolbox.",
  "ESRI 2024": "A source of information, likely a publication or report, related to geoprocessing and Python scripting.",
  "Modeling and scripting": "A concept in geoprocessing that involves creating models and writing scripts, often in Python, to automate and streamline spatial analysis tasks.",
  "Python": "A high-level, interpreted programming language often used in geoprocessing and spatial analysis.",
  "ModelBuilder": "A visual programming tool provided by ESRI for building geoprocessing workflows.",
  "Zandbergen (2024)": "Another source of information, likely a publication or report, related to area-based analyses in geography.",
  "Area-Based Analyses": "A method of geographical analysis that involves assigning characteristics to whole areas instead of individual points.",
  "Polygon": "A plane figure that is described by a finite number of straight line segments connected to form a closed polygonal chain or polygonal circuit.",
  "Redistricting": "The process of drawing electoral district boundaries in the United States.",
  "Gerrymandering": "A practice intended to establish an unfair political advantage for a particular party or group by manipulating district boundaries.",
  "23rd Congressional District": "An old electoral district in California that was transformed into the 24th District after redistricting following the 2010 U.S. census.",
  "24th District": "A new, more compact electoral district in California that was formed after redistricting following the 2010 U.S. census.",
  "Centrality": "A concept in geography that involves several numerical measures of central tendency including mean, median, and mode.",
  "Centers": "Two-dimensional equivalents of the mean, used to summarize the locations of a set of points.",
  "Centroid or mean center": "The most convenient way of summarizing the locations of a set of points, found by taking the weighted average of the x and y coordinates.",
  "U. S. Bureau of the Census": "A government agency responsible for the United States Census. It provides data about the nation's people and economy.",
  "Dispersion": "A measure of how much the data values are spread out around the mean or central value.",
  "Standard deviation": "A measure of the amount of variation or dispersion of a set of values.",
  "Variance": "A measure of dispersion that represents the average of the squared differences from the mean.",
  "RMSE": "Root Mean Square Error, a measure of the differences between values predicted by a model or an estimator and the values observed.",
  "Analysis of Surfaces": "A geographical analysis that involves computing slope, aspect, watersheds, channels, and visibility.",
  "DEM": "Digital Elevation Model, a 3D representation of a terrain's surface.",
  "2015": "The year the source material was published, as referenced in the text.",
  "www.travelassociates.com": "A website mentioned in the text, presumably related to the topic of travel or geography.",
  "Orange County DEM": "Digital Elevation Model of Orange County, a 3D representation of a terrain's surface used for geographic analysis.",
  "River Channels": "The pathways through which a river flows.",
  "Santa Ana River": "A river in Southern California, mentioned in the text as flowing out of a gorge and emptying into the Pacific near Seal Beach.",
  "Seal Beach": "A coastal city in California, where the Santa Ana River is incorrectly predicted to empty into the Pacific.",
  "Newport Beach": "A coastal city in California, where the Santa Ana River actually empties into the Pacific.",
  "Geodesign": "A design and planning method which tightly couples the creation of design proposals with impact simulations informed by geographic contexts.",
  "Location-allocation problems": "Problems that involve determining where to place facilities and how to allocate resources to them.",
  "P-median problem": "An optimization problem that seeks the best locations for a given number of facilities to minimize the sum of the distances between each demand point and its nearest facility.",
  "Coverage problem": "An optimization problem that seeks to minimize the furthest distance traveled from a demand point to a facility.",
  "Hakimi’s theorem": "A theorem in network theory that simplifies location-allocation problems by stating that only junctions (nodes) in the network and places where there is demand need to be considered.",
  "Routing problems": "Problems that involve determining the best paths or routes for vehicles or other moving entities.",
  "Shortest-path problem": "A problem that seeks the path through a network that minimizes distance or some other measure.",
  "Traveling-salesman problem (TSP)": "An optimization problem that seeks to determine the shortest possible route that a traveling salesman can take to visit each city once and return to the origin city.",
  "Orienteering problem": "An optimization problem similar to the TSP, but with the objective to maximize the rewards associated with visiting a selection of the stops while minimizing the total distance traveled.",
  "Sears": "A retail company mentioned in the context of drivers scheduling and navigating workloads.",
  "Hypothesis testing": "A statistical method that uses sample data to evaluate a hypothesis about a population.",
  "Randomization tests": "Statistical tests that simulate a large number of random arrangements of the data as an alternative to traditional hypothesis testing.",
  "Santa Barbara": "A city in California, mentioned in the context of a sample study examining the relationship between vegetation cover class and elevation.",
  "ArcGIS Pro": "A geographic information system (GIS) application for creating and working with spatial data on your desktop.",
  "Quiz 4": "An assessment that will be administered via Quercus, covering materials of Week 9&10 Spatial Analysis I&II and recommended readings.",
  "Quercus": "The platform through which Quiz 4 will be administered.",
  "Week 9&10 Spatial Analysis I&II": "The subject matter that Quiz 4 will cover, including the recommended readings.",
  "Lab 3": "An event or session that will occur on Thursday, March 13, 2025.",
  "Thursday, March 13, 2025": "The date on which Lab 3 will take place."
}