{
  "Dr. Alex Kalynychenko": "A lecturer at the Department of Geography, Geomatics and Environment at the University of Toronto Mississauga.",
  "University of Toronto Mississauga": "A campus of the University of Toronto, hosting the Department of Geography, Geomatics and Environment.",
  "GGR 321 H5S": "A course taught by Dr. Alex Kalynychenko at the University of Toronto Mississauga, focused on Geographic Information Processing.",
  "Spatial Analysis I & II": "Topics covered in the lecture, focused on answering geospatial questions and solving location-oriented problems.",
  "ESRI": "A company that provides geographic information system software, web GIS and geodatabase management applications. Referenced as the source of certain materials and demos in the lecture.",
  "Carl Steinitz": "A scholar known for his work in geodesign",
  "Longley et al. (2015)": "A source of information discussing various concepts related to GIS, including redistricting, centrality, and analysis of surfaces.",
  "ArcGIS Pro extensions": "Additional tools or features for the ArcGIS Pro software, used for various types of spatial and geospatial analysis.",
  "Machine learning and AI": "Techniques and algorithms used to automate the prediction, classification, and clustering of data, mentioned in the context of spatial analysis.",
  "Deep learning": "A subset of machine learning techniques that uses artificial neural networks to learn from data.",
  "Big data analytics": "The process of examining large and varied data sets to uncover hidden patterns, unknown correlations, market trends, customer preferences and other useful information.",
  "ArcGIS Pro": "A geographic information system for working with maps and geographic information maintained by the Environmental Systems Research Institute (Esri)",
  "Spark": "An open-source, distributed computing system used for big data processing and analytics.",
  "ESRI 2024": "A source of information related to geoprocessing and Python scripting in the context of geographic information systems (GIS).",
  "Modeling and scripting": "A concept in GIS that involves creating and executing scripts, often in Python, to automate geoprocessing tasks.",
  "Python": "A high-level, general-purpose programming language often used in GIS for scripting and automation.",
  "ModelBuilder": "A visual programming language for building geoprocessing workflows in ArcGIS, a GIS software developed by ESRI.",
  "Zandbergen (2024)": "A source of information discussing the purpose of area-based analyses in geography and GIS.",
  "Area-Based Analyses": "A method in geography and GIS where characteristics are ascribed to entire areas rather than individual points.",
  "Polygon": "A plane figure that is described by a finite number of straight line segments connected to form a closed polygonal chain or polygonal circuit.",
  "Redistricting": "The process of drawing electoral district boundaries in the United States, often associated with gerrymandering.",
  "Gerrymandering": "A practice intended to establish an unfair political advantage for a particular party or group by manipulating district boundaries.",
  "23rd Congressional District": "An old congressional district in California, mentioned in the context of redistricting.",
  "24th District": "A new, more compact congressional district in California, created after redistricting.",
  "Centrality": "A concept in geography and GIS that involves numerical measures of central tendency, such as mean, median, and mode.",
  "Centers": "Two-dimensional equivalents of the mean, used to summarize the locations of a set of points in GIS.",
  "Centroid or mean center": "The most convenient way of summarizing the locations of a set of points in GIS, found by taking the weighted average of the x and y coordinates.",
  "U. S. Bureau of the Census": "The government agency responsible for the United States Census. It provides data about the nation's people and economy.",
  "Dispersion": "A measure of how much the data values are spread out, often measured by standard deviation or variance in GIS.",
  "Standard deviation": "A measure that quantifies the amount of variation or dispersion of a set of values.",
  "Variance": "A statistical measurement of the spread between numbers in a data set.",
  "RMSE": "Root Mean Square Error, a measure of the differences between values predicted by a model or an estimator and the values observed.",
  "Analysis of Surfaces": "A concept in GIS that involves the study of surface characteristics, including slope, aspect, travel, watersheds, and channels.",
  "DEM": "Digital Elevation Model, a 3D representation of a terrain's surface created from terrain elevation data.",
  "2015": "Year of the source material",
  "https://www.travelassociates.com/": "Website URL, possibly related to the source material or the topic being discussed",
  "Orange County DEM": "Digital Elevation Model of Orange County, a 3D representation of a terrain's surface",
  "River Channels": "Paths where a river flows or could flow",
  "Santa Ana River": "A river in Southern California that flows from the San Bernardino mountains to the Pacific Ocean",
  "Gorge": "A narrow valley between hills or mountains, typically with steep rocky walls and a stream running through it",
  "Pacific": "The Pacific Ocean, where the Santa Ana River empties",
  "Seal Beach": "A coastal city in Orange County, California",
  "Newport Beach": "A coastal city in Orange County, California, where the Santa Ana River actually empties",
  "Geodesign": "A design and planning method which tightly couples the creation of design proposals with impact simulations informed by geographic contexts",
  "Location-allocation problems": "Problems that involve determining where to place facilities and how to allocate demand to them",
  "p-median problem": "A problem that seeks optimum locations for a certain number of central facilities to minimize the sum of the distances between each demand point and its nearest facility",
  "Coverage problem": "A problem that seeks to minimize the furthest distance traveled from a demand point to a facility",
  "Hakimi’s theorem": "A theorem in network theory that states only junctions (nodes) in the network and places where there is demand need to be considered when solving location-allocation problems",
  "Routing problems": "Problems that involve determining the optimal paths or routes for vehicles or deliveries",
  "Shortest-path problem": "A problem that finds the shortest path through a network between a defined origin and destination",
  "Traveling-salesman problem (TSP)": "A problem that seeks to determine the shortest possible route that visits each city once and returns to the origin city",
  "Orienteering problem": "A problem similar to TSP but the objective is to maximize the rewards associated with visiting a selection of the stops while minimizing the total distance traveled",
  "Sears": "An American chain of department stores",
  "Hypothesis testing": "A statistical method that uses sample data to evaluate a hypothesis about a population",
  "Randomization tests": "Statistical tests that simulate a large number of random arrangements of the data",
  "Santa Barbara": "A city in California, north of which the sample of points for vegetation cover class and elevation is taken",
  "Spatial Analysis": "A type of geographical analysis which seeks to explain patterns of human behavior and its spatial expression in terms of mathematics and geometry, that is, locational analysis",
  "Quiz 4": "An assessment that will be administered via Quercus next week, covering materials from Week 9&10 Spatial Analysis I&II and recommended readings.",
  "Quercus": "The platform through which Quiz 4 will be administered.",
  "Week 9&10 Spatial Analysis I&II": "The subject matter that Quiz 4 will cover, presumably part of the course curriculum.",
  "Recommended readings": "Additional materials suggested for study in preparation for Quiz 4.",
  "Lab 3": "A lab session that is scheduled to occur on Thursday, March 13, 2025.",
  "Thursday, March 13, 2025": "The date on which Lab 3 is scheduled to occur."
}