{
  "Dr. Alex Kalynychenko": "A lecturer at the University of Toronto Mississauga, Department of Geography, Geomatics and Environment.",
  "University of Toronto Mississauga": "A university located in Mississauga, Canada, where Dr. Alex Kalynychenko is a lecturer.",
  "GGR 321 H5S": "A course code related to the lecture on Spatial Analysis.",
  "Spatial Analysis": "A type of geographical analysis which seeks to explain patterns of human behavior and its spatial expression in terms of mathematics and geometry",
  "ESRI": "An international supplier of Geographic Information System software, web GIS and geodatabase management applications. The company is known for its software suite ArcGIS.",
  "Carl Steinitz": "A renowned scholar in the field of geodesign",
  "Geodesign": "A design and planning method which tightly couples the creation of design proposals with impact simulations informed by geographic contexts",
  "ArcGIS Pro extensions": "Special tools designed to enhance the capabilities of ArcGIS Pro, a powerful, single desktop GIS application. These extensions include 3D Analyst, Business Analyst, Geostatistical Analyst, Image Analyst, Network Analyst, and Spatial Analyst.",
  "Machine Learning": "A set of data-driven algorithms and techniques that automate the prediction, classification, and clustering of data.",
  "AI": "Artificial Intelligence, a branch of computer science that aims to imbue software with the ability to analyze its environment using either predetermined rules and search algorithms, or pattern recognizing machine learning models, and make decisions based on those analyses.",
  "Deep Learning": "A subset of machine learning techniques that uses artificial neural networks to learn from data.",
  "Big Data Analytics": "The process of examining large and varied data sets to uncover hidden patterns, unknown correlations, market trends, customer preferences and other useful information.",
  "Aristotle": "An ancient Greek philosopher and scientist, mentioned here in the context of known vs unknown limitations.",
  "Spark": "An open-source, distributed computing system used for big data processing and analytics.",
  "Raster Analysis": "A type of spatial analysis that uses a grid of cells (or pixels) to represent the spatial pattern of one or more features.",
  "ESRI 2024": "A source of information, likely related to geographic information systems (GIS) and spatial analysis.",
  "Modeling and scripting": "Concepts related to creating digital representations of systems and automating tasks in programming.",
  "Geoprocessing framework": "A structure or set of rules for processing geographic information.",
  "Python scripts": "Programs written in the Python programming language, often used for automating tasks.",
  "ModelBuilder": "A visual programming language for building geoprocessing workflows in ArcGIS, a software developed by ESRI.",
  "Zandbergen (2024)": "Another source of information, possibly related to geographic or spatial analysis.",
  "Area-Based Analyses": "A method of analysis that focuses on specific geographical areas.",
  "Polygon": "A plane figure that is described by a finite number of straight line segments connected to form a closed polygonal chain or polygonal circuit.",
  "Redistricting": "The process of drawing electoral district boundaries in the United States.",
  "2010 U.S. census": "A decennial census conducted by the U.S. Census Bureau, providing official and detailed data about the U.S. population.",
  "Gerrymandering": "A practice that attempts to establish a political advantage for a particular party or group by manipulating district boundaries.",
  "23rd Congressional District": "A former electoral district in California, U.S.",
  "24th District": "A new, more compact electoral district in California, U.S., formed after redistricting.",
  "Centrality": "A concept in spatial analysis that refers to the central point of a geographic feature.",
  "Mean, median, and mode": "Statistical measures of central tendency.",
  "Centroid or mean center": "The arithmetic mean position of all the points in a figure.",
  "U.S. Bureau of the Census": "The government agency that is responsible for the United States Census.",
  "Dispersion": "A measure of how much the data values are spread out around the mean.",
  "Standard deviation": "A measure of the amount of variation or dispersion of a set of values.",
  "Variance": "The expectation of the squared deviation of a random variable from its mean.",
  "RMSE (Root Mean Square Error)": "A measure of the differences between values predicted by a model and the values observed.",
  "Analysis of Surfaces": "A method of analysis that focuses on the properties and features of geographical surfaces.",
  "Slope and aspect": "Properties of a surface indicating its steepness and orientation.",
  "DEM (Digital Elevation Model)": "A 3D representation of a terrain's surface.",
  "Queen’s case move set": "A concept in spatial analysis referring to the eight possible movements of a cell in a grid, similar to the possible moves of a queen in chess.",
  "Watersheds and channels": "Geographical features related to water flow and drainage.",
  "2015": "Year of the source material",
  "https://www.travelassociates.com/": "Website URL",
  "Orange County DEM": "Digital Elevation Model for Orange County, a 3D representation of a terrain's surface",
  "River Channels": "Paths through which a river flows",
  "Santa Ana River": "A river in Southern California, USA",
  "Pacific": "The Pacific Ocean",
  "Seal Beach": "A city in Orange County, California, USA",
  "Newport Beach": "A city in Orange County, California, USA",
  "Longley et al. (2015)": "Authors of the source material",
  "Location-allocation problems": "Problems that involve determining where to place facilities and how to allocate demand to them",
  "p-median problem": "A problem that seeks optimum locations for a certain number of central facilities to minimize the sum of the distances between each weight and the nearest facility",
  "Coverage problem": "A problem that seeks to minimize the furthest distance traveled",
  "Hakimi’s theorem": "A theorem in network theory stating that only junctions (nodes) in the network and places where there is weight need to be considered",
  "Routing problems": "Problems that involve determining the optimum paths for vehicles",
  "Shortest-path problem": "A problem that finds the path through the network between a defined origin and destination that minimizes distance",
  "Traveling-salesman problem (TSP)": "A problem that seeks to find the shortest possible route that visits each city and returns to the origin city",
  "Orienteering problem": "A problem similar to TSP but the objective is to maximize the rewards associated with visiting a selection of the stops while minimizing the total distance traveled",
  "Sears": "An American chain of department stores",
  "Hypothesis testing": "A statistical method that uses sample data to evaluate a hypothesis about a population",
  "Randomization tests": "Statistical tests that simulate a large number of random arrangements of the data",
  "Santa Barbara": "A city in California, USA",
  "ArcGIS Pro": "A powerful, single desktop GIS application, which is part of ESRI's ArcGIS platform",
  "Geodesign principles": "Principles that guide the geodesign process, a method which tightly couples the creation of design proposals with impact simulations informed by geographic contexts",
  "Quiz 4": "An assessment to be administered via Quercus, covering materials from Week 9&10 Spatial Analysis I&II and recommended readings.",
  "Quercus": "The platform through which Quiz 4 will be administered.",
  "Week 9&10 Spatial Analysis I&II": "The materials that will be covered in Quiz 4, presumably topics covered in the 9th and 10th week of a course.",
  "Recommended readings": "Additional materials suggested for study and understanding of the Week 9&10 Spatial Analysis I&II topics, and will be part of Quiz 4.",
  "Lab 3": "The third lab session of a course or subject, scheduled on Thursday, March 13, 2025.",
  "Thursday, March 13, 2025": "The date on which Lab 3 will take place."
}