{
  "Dr. Alex Kalynychenko": "A lecturer at the University of Toronto Mississauga, specifically in the Department of Geography, Geomatics and Environment.",
  "University of Toronto Mississauga": "A campus of the University of Toronto, known for its research in various fields, including geography and geomatics.",
  "GGR 321 H5S": "A course code, likely referring to a specific class in Geography at the University of Toronto Mississauga.",
  "Spatial Analysis": "A set of methods used to analyze spatial data, revealing patterns, anomalies, and solutions for complex spatial problems.",
  "ESRI": "An international supplier of Geographic Information System (GIS) software, web GIS and geodatabase management applications.",
  "Carl Steinitz": "A renowned scholar in the field of geodesign, known for his practical applications of geodesign principles.",
  "Longley et al. (2015)": "A source of information, likely a publication or report, from an author named Longley and others in the year 2015.",
  "ArcGIS Pro": "A popular geographic information system (GIS) software for working with maps and geographic information, mentioned here in the context of geospatial tools and extensions for spatial analysis.",
  "3D Analyst": "An ArcGIS Pro extension used to analyze and create 3D GIS data and perform 3D surface operations.",
  "Business Analyst": "An ArcGIS Pro extension used for analyzing market trends, including customer and competitor analysis, site evaluation, and territory planning.",
  "Geostatistical Analyst": "An ArcGIS Pro extension used to analyze and predict the values associated with spatial or spatiotemporal phenomena.",
  "Image Analyst": "An ArcGIS Pro extension used to interpret and use imagery, perform feature extraction and measurement, and perform classification and object detection using machine learning.",
  "Network Analyst": "An ArcGIS Pro extension used to measure distances and travel times along a network to find a route between multiple locations, create drive-time buffers or service areas, and find the best locations for facilities to serve a set of locations.",
  "Spatial Analyst": "An ArcGIS Pro extension used to find the most suitable locations, calculate distance and determine optimal paths by incorporating the cost of travel, analyze and interpolate surfaces, calculate density, conduct hydrologic analysis, perform statistical analysis, and perform various raster-based mathematical operations.",
  "Aristotle": "An ancient Greek philosopher and scientist, mentioned here in the context of known vs unknown limitations.",
  "Machine learning": "A set of data-driven algorithms and techniques that automate the prediction, classification, and clustering of data.",
  "AI": "Artificial Intelligence, the simulation of human intelligence processes by machines, especially computer systems.",
  "Deep learning": "A subset of machine learning techniques that uses artificial neural networks to learn from data.",
  "Big data analytics": "The process of examining large and varied data sets to uncover hidden patterns, unknown correlations, market trends, customer preferences and other useful information.",
  "Spark": "An open-source distributed computing system used for big data processing and analytics.",
  "ESRI 2024": "A source of information, likely a publication or report, from ESRI (Environmental Systems Research Institute) in the year 2024. ESRI is a supplier of Geographic Information System (GIS) software, web GIS and geodatabase management applications.",
  "Modeling and scripting": "A process that involves creating digital representations of physical objects or systems and writing code to automate tasks or calculations.",
  "Python": "A high-level, interpreted programming language often used for scripting in various applications, including Geographic Information Systems (GIS).",
  "ModelBuilder": "A visual programming language for building geoprocessing workflows in ESRI's ArcGIS software.",
  "Zandbergen (2024)": "A source of information, likely a publication or report, from an author named Zandbergen in the year 2024.",
  "Area-Based Analyses": "A type of analysis that focuses on characteristics of defined geographic areas rather than individual points.",
  "Polygon": "A plane figure that is described by a finite number of straight line segments connected to form a closed polygonal chain or polygonal circuit.",
  "Redistricting": "The process of drawing electoral district boundaries in the United States.",
  "23rd Congressional District": "A former electoral district in the United States, which was transformed into a new, more compact 24th District.",
  "Gerrymandering": "A practice intended to establish an unfair political advantage for a particular party or group by manipulating district boundaries.",
  "Centrality": "A measure of the importance of a node within a graph, often used in network analysis.",
  "Mean, Median, Mode": "Statistical measures of central tendency. Mean is the average, median is the middle value in a data set, and mode is the most frequently occurring value.",
  "Centroid": "The geometric center of a plane figure or shape. In the context of this text, it is used as a way of summarizing the locations of a set of points.",
  "U.S. Bureau of the Census": "The government agency that is responsible for the United States Census. It provides data about the nation's people and economy.",
  "Dispersion": "A measure of how spread out the values in a data set are around the mean.",
  "Standard Deviation": "A measure of the amount of variation or dispersion of a set of values.",
  "Variance": "The average of the squared differences from the mean in a data set.",
  "RMSE": "Root Mean Square Error, a measure of the differences between values predicted by a model or an estimator and the values observed.",
  "Analysis of Surfaces": "A type of analysis in GIS that deals with the measurement and modeling of the geographic distributions of phenomena over the Earth's surface.",
  "DEM": "Digital Elevation Model, a 3D representation of a terrain's surface created from terrain elevation data.",
  "2015": "The year mentioned in the text, possibly the year of the source material or the year of the analysis.",
  "https://www.travelassociates.com/": "A website URL, presumably the source of some information or related to the topic of discussion.",
  "Orange County DEM": "Digital Elevation Model of Orange County, a 3D representation of a terrain's surface.",
  "River Channels": "The physical course containing flowing water in the landscape.",
  "Santa Ana River": "A river in Southern California that flows from the San Bernardino mountains to the Pacific Ocean.",
  "Seal Beach": "A coastal city in Orange County, California, where the Santa Ana River was initially predicted to empty into the Pacific.",
  "Newport Beach": "A coastal city in Orange County, California, where the Santa Ana River actually empties into the Pacific.",
  "Geodesign": "A design and planning method which tightly couples the creation of design proposals with impact simulations informed by geographic contexts.",
  "Location-allocation problems": "Problems that involve determining where to place facilities and how to allocate resources to them.",
  "P-median problem": "A mathematical problem that seeks to find the optimum locations for a given number of facilities to minimize the sum of the distances between each demand point and its nearest facility.",
  "Coverage problem": "A problem that aims to minimize the furthest distance traveled by customers or users to a facility.",
  "Continuous space": "A concept in location-allocation problems where there are infinite possible locations for a facility.",
  "Hakimi’s theorem": "A theorem in network analysis stating that optimal locations are at the nodes or weighted points in the network.",
  "Routing problems": "Problems that involve determining the best paths or routes for vehicles or other moving entities.",
  "Shortest-path problem": "A problem that seeks to find the path through a network that minimizes distance or some other measure.",
  "Traveling-salesman problem (TSP)": "A problem that aims to find the shortest possible route that visits a given set of places and returns to the origin.",
  "Orienteering problem": "A problem similar to TSP, but aims to maximize the rewards associated with visiting a selection of stops while minimizing the total distance traveled.",
  "Sears": "An American chain of department stores, mentioned here in the context of a system used by its drivers for scheduling and navigating workloads.",
  "Hypothesis testing": "A statistical method for making inferences or conclusions about a larger population based on a sample.",
  "Randomization tests": "Statistical tests that simulate a large number of random arrangements of the data.",
  "Santa Barbara": "A city in California, mentioned here in the context of a sample of points used to examine the relationship between vegetation cover class and elevation.",
  "Geodesign principles": "The key principles or guidelines followed in the field of geodesign.",
  "Quiz 4": "An assessment that will be administered via Quercus next week, covering materials of Week 9&10 Spatial Analysis I&II and recommended readings.",
  "Quercus": "The platform through which Quiz 4 will be administered.",
  "Week 9&10 Spatial Analysis I&II": "The materials that will be covered in Quiz 4, presumably from a course or study program.",
  "Recommended readings": "Additional materials suggested for studying in preparation for Quiz 4.",
  "Lab 3": "The next lab session, scheduled for Thursday, March 13, 2025.",
  "Thursday, March 13, 2025": "The date on which Lab 3 is scheduled."
}