{
  "Dr. Alex Kalynychenko": "A lecturer at the Department of Geography, Geomatics and Environment, University of Toronto Mississauga, who is presenting a lecture on Spatial Analysis.",
  "University of Toronto Mississauga": "A campus of the University of Toronto where Dr. Alex Kalynychenko is based.",
  "Spatial Analysis": "A set of methods applied to spatial data to reveal patterns and anomalies, find solutions for complex spatial problems and support decision-making",
  "ESRI": "A supplier of Geographic Information System software, web GIS and geodatabase management applications. Mentioned in the context of a demo and as a source of information.",
  "Carl Steinitz": "A person who developed a schematic model of the geodesign process",
  "Longley et al. (2015)": "A source of information, possibly a publication, related to various geographical and statistical concepts such as centrality, dispersion, and analysis of surfaces.",
  "ArcGIS Pro extensions": "Specialized tools within the ArcGIS Pro software that are designed to perform various types of spatial analysis.",
  "Aristotle": "A classical Greek philosopher mentioned in the context of known vs unknown limitations.",
  "Machine learning": "A set of data-driven algorithms and techniques that automate the prediction, classification, and clustering of data.",
  "AI": "Artificial Intelligence, a branch of computer science that aims to create systems capable of performing tasks that normally require human intelligence.",
  "Deep learning": "A subset of machine learning techniques that uses artificial neural networks to learn from data.",
  "Big data analytics": "The process of examining large and varied data sets to uncover hidden patterns, unknown correlations, market trends, customer preferences and other useful information. Mentioned in the context of ArcGIS Pro tools.",
  "ESRI 2024": "A source of information, possibly a publication or event, related to geoprocessing and scripting.",
  "Modeling and scripting": "A concept related to the use of programming and mathematical models to simulate, analyze, and manipulate data and systems.",
  "Python": "A high-level, interpreted programming language often used in data analysis and scripting.",
  "ModelBuilder": "A visual programming language for building geoprocessing workflows in ESRI's ArcGIS software.",
  "Zandbergen (2024)": "Another source of information, possibly a publication or event, related to area-based analyses.",
  "Area-Based Analyses": "A concept related to the study or measurement of geographical areas for various purposes, such as redistricting or geographical simplification.",
  "Polygon": "A plane figure that is described by a finite number of straight line segments connected to form a closed polygonal chain or polygonal circuit.",
  "Centrality": "A statistical measure that determines the center point or central tendency in a dataset.",
  "Mean": "The average value of a set of numbers, calculated by adding all numbers in the set and dividing by the quantity of numbers.",
  "Median": "The middle value in a set of numbers, where half the numbers are above the median and half are below.",
  "Mode": "The value that appears most frequently in a data set.",
  "Centroid": "The geometric center of a plane figure or shape.",
  "U. S. Bureau of the Census": "A part of the U.S. Federal Statistical System responsible for producing data about the American people and economy.",
  "Dispersion": "A measure of how spread out the values in a data set are around the mean.",
  "Standard Deviation": "A measure of the amount of variation or dispersion in a set of values.",
  "Variance": "The average of the squared differences from the Mean.",
  "RMSE": "Root Mean Square Error, a measure of the differences between values predicted by a model and the values actually observed.",
  "Analysis of Surfaces": "A concept related to the study or measurement of geographical surfaces for various purposes, such as computing watersheds and channels or modeling travel on a surface.",
  "DEM": "Digital Elevation Model, a 3D representation of a terrain's surface.",
  "2015": "The year in which the source material was published",
  "https://www.travelassociates.com/": "The website URL mentioned in the text",
  "Orange County DEM": "Digital Elevation Model of Orange County, a 3D representation of a terrain's surface",
  "river channels": "Paths that rivers take through the landscape",
  "Santa Ana River": "A river in Southern California that flows out of a gorge and empties into the Pacific Ocean",
  "Seal Beach": "A coastal city in Orange County, California, where the Santa Ana River was initially thought to empty into",
  "Newport Beach": "A coastal city in Orange County, California, where the Santa Ana River actually empties into",
  "geodesign process": "A design and planning method which tightly couples the creation of design proposals with impact simulations informed by geographic contexts",
  "location-allocation problems": "Problems that involve determining where to place facilities and how to allocate demand to them",
  "p-median problem": "A problem that seeks optimum locations for a certain number of central facilities to minimize the sum of the distances between each weight and the nearest facility",
  "coverage problem": "A problem that seeks to minimize the furthest distance traveled by customers to a central facility",
  "Hakimi’s theorem": "A theorem stating that only junctions (nodes) in the network and places where there is weight need to be considered in location-allocation problems",
  "routing problems": "Problems that involve decisions about the optimum tracks followed by vehicles",
  "shortest-path problem": "A problem that finds the path through the network between a defined origin and destination that minimizes distance",
  "traveling-salesman problem (TSP)": "A problem to select the best tour out of all possible orderings of places to visit, in order to minimize the distance traveled",
  "orienteering problem": "A problem similar to TSP but the objective is to maximize the rewards associated with visiting a selection of the stops while minimizing the total distance traveled",
  "Sears": "A company whose drivers use a system for scheduling and navigating a day’s workload",
  "hypothesis testing": "A statistical method that uses information obtained from samples to make general conclusions about a larger population",
  "randomization tests": "Tests which simulate a large number of random arrangements of the data",
  "Santa Barbara": "A city in California where a sample of points was used to examine the relationship between vegetation cover class and elevation",
  "ArcGIS Pro": "A professional Geographic Information System application for creating and working with spatial data",
  "geodesign principles": "Principles that guide the process of designing with geographic information",
  "Quiz 4": "A test that will be administered via Quercus next week, covering materials of Week 9&10 Spatial Analysis I&II and recommended readings.",
  "Quercus": "The platform through which Quiz 4 will be administered.",
  "Week 9&10 Spatial Analysis I&II": "The materials that will be covered in Quiz 4, presumably part of a course or study program.",
  "Recommended readings": "Additional materials suggested for study in preparation for Quiz 4.",
  "Lab 3": "A laboratory session or practical class that is scheduled for Thursday, March 13, 2025.",
  "Thursday, March 13, 2025": "The date on which Lab 3 will take place."
}