{
  "Dr. Alex Kalynychenko": "A lecturer at the Department of Geography, Geomatics and Environment, University of Toronto Mississauga, who is delivering a lecture on Spatial Analysis.",
  "University of Toronto Mississauga": "A campus of the University of Toronto, where Dr. Alex Kalynychenko is a faculty member.",
  "GGR 321 H5S": "The course code for the lecture being delivered by Dr. Alex Kalynychenko.",
  "Spatial Analysis": "A type of geographical analysis which seeks to explain patterns of human behavior and its spatial expression in terms of mathematics and geometry, that is, locational analysis.",
  "ESRI": "A supplier of Geographic Information System (GIS) software, web GIS and geodatabase management applications. In this context, it is the source of the demo and materials used in the lecture.",
  "Carl Steinitz": "A scholar known for his work in geodesign, a field that combines geography and design.",
  "ArcGIS Pro": "A popular geographic information system (GIS) application for creating and working with spatial data on your desktop.",
  "Machine Learning": "A set of data-driven algorithms and techniques that automate the prediction, classification, and clustering of data. Discussed in the context of spatial analysis.",
  "AI": "Artificial Intelligence, a branch of computer science dealing with the simulation of intelligent behavior in computers.",
  "Deep Learning": "A subset of machine learning techniques that uses artificial neural networks to learn from data. Discussed in the context of spatial analysis.",
  "Big Data Analytics": "The process of examining large and varied data sets to uncover hidden patterns, unknown correlations, market trends, customer preferences and other useful information. Discussed in the context of spatial analysis.",
  "ArcGIS Pro Extensions": "Specialized tools designed to enhance the functionality of ArcGIS Pro software. Discussed in the context of spatial analysis.",
  "Spark": "An open-source, distributed computing system used for big data processing and analytics. In this context, it is used for analysis on a desktop machine.",
  "ESRI 2024": "A source of information in the text, possibly a publication or event in the year 2024 related to ESRI, a company specializing in Geographic Information Systems (GIS).",
  "Modeling and scripting": "A concept referring to the process of creating digital representations of physical objects or processes and automating tasks in a programming language.",
  "Geoprocessing framework": "A concept in GIS that involves the manipulation and analysis of spatial data.",
  "Python scripts": "Programs written in Python, a high-level, interpreted programming language often used for automating tasks and data analysis.",
  "ModelBuilder": "A visual programming language for building geoprocessing workflows in ArcGIS, a software developed by ESRI.",
  "Zandbergen (2024)": "Another source of information in the text, possibly a publication or author named Zandbergen, dated 2024.",
  "Area-Based Analyses": "A concept in geography and GIS that involves analyzing data based on defined areas rather than individual points.",
  "Polygon": "A plane figure that is described by a finite number of straight line segments connected to form a closed polygonal chain or polygonal circuit.",
  "Longley et al. (2015)": "A source of information in the text, possibly a publication authored by Longley and others, dated 2015.",
  "Redistricting": "The process of redrawing electoral district boundaries, often after a census.",
  "Gerrymandering": "The practice of manipulating the boundaries of an electoral constituency to favor a particular political party or group.",
  "23rd Congressional District and 24th District": "Specific electoral districts in the United States, possibly in California based on the context.",
  "Centrality": "A concept in geography and statistics that refers to the central point or location of a distribution.",
  "Mean, median, mode": "Statistical measures of central tendency, representing the average, middle, and most frequently occurring values in a dataset, respectively.",
  "Centroid": "The geometric center of a plane figure or shape.",
  "U. S. Bureau of the Census": "A U.S. government agency responsible for conducting the national census and providing statistical information about the U.S. population.",
  "Dispersion": "A statistical concept that represents the spread or variability in a dataset.",
  "Standard deviation, variance, RMSE": "Statistical measures of dispersion or variability in a dataset.",
  "Analysis of Surfaces": "A concept in GIS that involves studying the characteristics and properties of a surface, such as its slope, aspect, and travel potential.",
  "Slope and aspect": "Geographical concepts referring to the steepness and orientation of a surface, respectively.",
  "DEM": "Digital Elevation Model, a 3D representation of a terrain's surface.",
  "2015": "The year of the source material referenced throughout the text.",
  "https://www.travelassociates.com/": "Website URL, possibly related to the source or context of the text.",
  "Orange County DEM": "Digital Elevation Model of Orange County, a 3D representation of a terrain's surface.",
  "River Channels": "Paths through which a river flows.",
  "Santa Ana River": "A river in Southern California that flows from the San Bernardino mountains to the Pacific Ocean.",
  "Pacific": "The Pacific Ocean, where the Santa Ana River empties.",
  "Seal Beach": "A city in Orange County, California, near where the Santa Ana River was initially thought to empty into the Pacific.",
  "Newport Beach": "A city in Orange County, California, where the Santa Ana River actually empties into the Pacific.",
  "Geodesign": "A design and planning method which tightly couples the creation of design proposals with impact simulations informed by geographic contexts.",
  "Location-allocation problems": "Problems in spatial analysis that involve determining where to place facilities and how to distribute resources.",
  "p-median problem": "A problem in spatial analysis that seeks to minimize the sum of the distances between each demand point and the nearest facility.",
  "Coverage problem": "A problem in spatial analysis that seeks to minimize the furthest distance traveled from a point to a facility.",
  "Hakimi’s theorem": "A theorem in network analysis stating that optimal locations are at the vertices or demand points.",
  "Routing problems": "Problems in spatial analysis that involve determining the optimal paths or routes.",
  "Shortest-path problem": "A problem in spatial analysis that seeks to find the shortest path through a network from a defined origin to a destination.",
  "Traveling-salesman problem (TSP)": "A problem in spatial analysis that seeks to determine the shortest possible route that visits each place once and returns to the origin.",
  "Orienteering problem": "A problem in spatial analysis that seeks to maximize the rewards of visiting certain stops while minimizing the total distance traveled.",
  "Sears": "A retail company, mentioned here in the context of routing problems for delivery drivers.",
  "Hypothesis testing": "A statistical method used to make inferences or draw conclusions about a larger population based on a sample.",
  "Randomization tests": "Statistical tests that simulate a large number of random arrangements of data to make inferences about a population.",
  "Santa Barbara": "A city in California, mentioned here in the context of a study examining the relationship between vegetation cover class and elevation.",
  "Quiz 4": "A test that will be administered via Quercus, covering materials of Week 9&10 Spatial Analysis I&II and recommended readings.",
  "Quercus": "The platform through which Quiz 4 will be administered.",
  "Week 9&10 Spatial Analysis I&II": "The material that will be covered in Quiz 4, presumably part of a course curriculum.",
  "Recommended readings": "Additional materials suggested for study in preparation for Quiz 4.",
  "Lab 3": "A laboratory session, presumably part of a course curriculum, scheduled for Thursday, March 13, 2025.",
  "Thursday, March 13, 2025": "The date on which Lab 3 is scheduled to take place."
}