{
  "Dr. Alex Kalynychenko": "A lecturer at the University of Toronto Mississauga, Department of Geography, Geomatics and Environment, who presented the lecture on Spatial Analysis.",
  "University of Toronto Mississauga": "A campus of the University of Toronto where Dr. Alex Kalynychenko is based.",
  "Spatial Analysis": "A type of geographical analysis which seeks to explain patterns of human behavior and its spatial expression in terms of mathematics and geometry, that is, locational analysis.",
  "GGR 321 H5S": "A course code, possibly related to the lecture on Spatial Analysis.",
  "ESRI": "An international supplier of Geographic Information System software, web GIS and geodatabase management applications. Mentioned in the context of a demo and as the source of several tools and concepts discussed in the lecture.",
  "Carl Steinitz": "A scholar known for his work in geodesign, a field that combines geography with design.",
  "Longley et al. (2015)": "A source of information, possibly a publication or report, from the year 2015 by Longley and other authors or researchers.",
  "ArcGIS Pro extensions": "A set of tools designed to perform various tasks in spatial analysis, including 3D analysis, business analysis, geostatistical analysis, image analysis, network analysis, and spatial analysis.",
  "Machine learning": "A set of data-driven algorithms and techniques that automate the prediction, classification, and clustering of data.",
  "AI": "Artificial Intelligence, a field of computer science that simulates human intelligence processes by machines.",
  "Deep learning": "A subset of machine learning techniques that uses artificial neural networks to learn from data.",
  "Big data analytics": "The process of examining large and varied data sets to uncover hidden patterns, unknown correlations, market trends, customer preferences and other useful information. In the context of the text, it is related to ArcGIS Pro tools that transform large amounts of spatial data into manageable information.",
  "ESRI 2024": "A source of information, possibly a publication or report, from the year 2024 by ESRI, a company specializing in Geographic Information System (GIS) software.",
  "Modeling and scripting": "A concept in programming and data analysis that involves creating representations of systems or processes and writing scripts, or sets of instructions, to manipulate or analyze those models.",
  "Geoprocessing framework": "A set of tools and functionalities in GIS that allows users to perform spatial analysis or manage GIS data.",
  "Python": "A high-level, interpreted programming language often used for scripting in various fields, including GIS.",
  "ModelBuilder": "A visual programming tool provided by ESRI for building geoprocessing workflows in ArcGIS, a GIS software.",
  "Zandbergen (2024)": "A source of information, possibly a publication or report, from the year 2024 by Zandbergen, an author or researcher.",
  "Area-Based Analyses": "A type of geographical analysis that involves studying characteristics of defined areas rather than individual points.",
  "Polygon": "A plane figure that is described by a finite number of straight line segments connected to form a closed polygonal chain or polygonal circuit.",
  "Redistricting": "The process of drawing electoral district boundaries in the United States.",
  "Gerrymandering": "A practice intended to establish an unfair political advantage for a particular party or group by manipulating district boundaries.",
  "23rd Congressional District": "A specific electoral district in the United States, which was transformed into the 24th District after the 2010 U.S. census.",
  "Centrality": "A concept in statistics and data analysis that refers to the measure of the 'center' of a data set.",
  "Mean, Median, Mode": "Statistical measures of central tendency. Mean is the average, median is the middle value, and mode is the most frequently occurring value in a data set.",
  "Centroid": "In the context of geography, it is the geographical center or 'average location' of a spatial feature.",
  "U. S. Bureau of the Census": "The U.S. federal agency responsible for conducting the national census at least once every 10 years.",
  "Dispersion": "A statistical term describing the degree to which individual data points are distributed around the mean.",
  "Standard deviation": "A measure of the amount of variation or dispersion of a set of values.",
  "Variance": "A statistical measurement of the spread between numbers in a data set.",
  "RMSE": "Root Mean Square Error, a frequently used measure of the differences between values predicted by a model and the values actually observed.",
  "Analysis of Surfaces": "A type of geographical analysis that involves studying the characteristics of surfaces, such as slope, aspect, and visibility.",
  "DEM": "Digital Elevation Model, a 3D representation of a terrain's surface commonly used in GIS to analyze surface characteristics.",
  "2015": "The year of publication for the source material.",
  "www.travelassociates.com": "The website URL mentioned in the text, presumably related to travel.",
  "Orange County DEM": "Digital Elevation Model (DEM) of Orange County, a tool used for terrain representation.",
  "River channels": "Natural watercourses that contain flowing water.",
  "Santa Ana River": "A river in Southern California that flows from the San Bernardino mountains to the Pacific Ocean.",
  "Seal Beach": "A coastal city located in Orange County, California.",
  "Newport Beach": "Another coastal city in Orange County, California, where the Santa Ana River actually empties.",
  "Geodesign": "A design and planning method which tightly couples the creation of design proposals with impact simulations informed by geographic contexts.",
  "Location-allocation problems": "Problems in operational research that deal with issues related to the optimal location of facilities and the allocation of entities to those facilities.",
  "P-median problem": "A type of location-allocation problem that seeks optimal locations for a specified number of facilities to minimize total distance.",
  "Coverage problem": "A type of location-allocation problem that seeks to minimize the furthest distance traveled.",
  "Continuous space": "A concept in geography that assumes an infinite number of locations for a site.",
  "Hakimi’s theorem": "A theorem in network analysis that simplifies location-allocation problems by considering only junctions (nodes) and places where there is weight.",
  "Routing problems": "Problems that involve determining the optimal routes for vehicles or other moving entities.",
  "Shortest-path problem": "A type of routing problem that seeks the shortest or least costly path between two points in a network.",
  "Traveling-salesman problem (TSP)": "A classic algorithmic problem in the field of operations research and theoretical computer science that focuses on optimization. It involves finding the shortest possible route for a salesman who needs to visit a number of cities and return to the origin city.",
  "Orienteering problem": "A routing problem similar to TSP, but with the objective to maximize the rewards associated with visiting a selection of stops while minimizing the total distance traveled.",
  "Sears": "A department store company, mentioned here in the context of a system used by its drivers for scheduling and navigating workloads.",
  "Hypothesis testing": "A statistical method that uses sample data to evaluate a hypothesis about a population.",
  "Randomization tests": "Statistical tests that simulate a large number of random arrangements of the data as an alternative to traditional hypothesis testing.",
  "Santa Barbara": "A city in California, mentioned here in the context of a sample study examining the relationship between vegetation cover class and elevation.",
  "ArcGIS Pro": "A powerful, single desktop GIS application, known for its advanced visualization, data management, and analysis capabilities.",
  "Quiz 4": "A quiz that will be administered via Quercus next week, covering materials of Week 9&10 Spatial Analysis I&II and recommended readings.",
  "Quercus": "The platform through which Quiz 4 will be administered.",
  "Week 9&10 Spatial Analysis I&II": "The materials that will be covered in Quiz 4, presumably topics related to spatial analysis studied during weeks 9 and 10 of the course.",
  "Recommended readings": "Additional materials suggested for study in preparation for Quiz 4.",
  "Lab 3": "The next lab session in the course, scheduled for Thursday, March 13, 2025.",
  "Thursday, March 13, 2025": "The date on which Lab 3 will take place."
}