{
  "Dr. Alex Kalynychenko": "A lecturer at the Department of Geography, Geomatics and Environment, University of Toronto Mississauga, who is presenting a lecture on Spatial Analysis.",
  "University of Toronto Mississauga": "A campus of the University of Toronto, where the lecture on Spatial Analysis is being held.",
  "Spatial Analysis": "A set of methods applied to spatial data to reveal patterns and anomalies, find solutions for complex spatial problems, and support decision-making.",
  "ESRI": "A supplier of Geographic Information System software, web GIS and geodatabase management applications, referenced multiple times in the lecture for their contributions to spatial analysis and geodesign.",
  "Carl Steinitz": "A person who developed a schematic model of the geodesign process.",
  "Longley et al. (2015)": "A source of information, likely a publication or report, from an author or group of authors named Longley and others in the year 2015.",
  "ArcGIS Pro extensions": "A set of tools designed to perform various spatial analysis tasks, such as 3D analysis, market trends analysis, prediction of values associated with spatial phenomena, imagery interpretation, network analysis, and more.",
  "Aristotle": "A famous philosopher, mentioned in the context of known vs unknown limitations.",
  "Machine learning and AI": "A set of data-driven algorithms and techniques that automate the prediction, classification, and clustering of data. Deep learning, a subset of machine learning, uses artificial neural networks to learn from data.",
  "Big data analytics": "A process of examining large and varied data sets to uncover hidden patterns, unknown correlations, market trends, customer preferences and other useful information. In the context of the lecture, it is related to the tools in ArcGIS Pro that can transform large amounts of spatial data into manageable information.",
  "ESRI 2024": "A source of information, likely a publication or report, from the company ESRI in the year 2024.",
  "Modeling and scripting": "A concept in programming and data analysis that involves creating mathematical or computational representations of systems and automating tasks or processes.",
  "Geoprocessing framework": "A set of tools and functionalities used in geographic information system (GIS) applications to manipulate geospatial data.",
  "Python scripts": "Programs written in the Python programming language, often used for automating tasks or processing data.",
  "ModelBuilder": "A visual programming language for building geoprocessing workflows in ESRI's ArcGIS software.",
  "Zandbergen (2024)": "Another source of information, likely a publication or report, from an author or organization named Zandbergen in the year 2024.",
  "Area-Based Analyses": "A method of geographical analysis that involves assigning characteristics to entire areas rather than individual points.",
  "Polygon": "In the context of geography and GIS, a polygon is a plane figure that is described by a finite number of straight line segments connected to form a closed chain or circuit.",
  "Trapezia": "Plural of trapezium, a four-sided figure with no parallel sides. In the context of this text, trapezia are used in the calculation of area.",
  "Redistricting": "The process of drawing electoral district boundaries, often after a census.",
  "Gerrymandering": "The practice of manipulating the boundaries of an electoral constituency to favor one party or class.",
  "23rd Congressional District": "A specific electoral district in the United States, which was transformed into the 24th District after the 2010 census.",
  "Centrality": "A concept in geography and statistics that refers to the central point or location of a distribution.",
  "Mean, median, and mode": "Statistical measures of central tendency. The mean is the average, the median is the middle value, and the mode is the most frequently occurring value.",
  "Centroid or mean center": "The point at which the weighted average of the x and y coordinates of a set of points is found. It is a measure of the central location of a distribution in two dimensions.",
  "U. S. Bureau of the Census": "A government agency in the United States responsible for conducting the national census and providing statistical information about the U.S. population.",
  "Dispersion": "A statistical concept that refers to the spread or variability of a set of values.",
  "Standard deviation and variance": "Measures of dispersion in statistics. Standard deviation is the square root of the variance, which measures the average squared difference from the mean.",
  "RMSE": "Root Mean Square Error, a measure of the differences between values predicted by a model or an estimator and the values observed.",
  "Analysis of Surfaces": "A concept in geography and GIS that involves studying the characteristics of a surface, such as slope, aspect, and visibility.",
  "DEM": "Digital Elevation Model, a 3D representation of a terrain's surface created from terrain elevation data.",
  "2015": "The year in which the source material was published, referenced multiple times in the text.",
  "https://www.travelassociates.com/": "Website URL mentioned in the text, possibly related to the source or the topic of discussion.",
  "Orange County DEM": "Digital Elevation Model of Orange County, a 3D representation of a terrain's surface.",
  "River Channels": "Paths through which a river flows, shown in red in the context of the text.",
  "Santa Ana River": "A river that flows out of a gorge and into the Pacific near Seal Beach, according to the analysis of the Orange County DEM.",
  "Seal Beach": "A city in Orange County, California, where the Santa Ana River is predicted to empty into the Pacific.",
  "Newport Beach": "A city in Orange County, California, where the Santa Ana River actually empties into the Pacific.",
  "Geodesign": "A design and planning method which tightly couples the creation of design proposals with impact simulations informed by geographic contexts.",
  "Location-allocation problems": "Problems that involve determining where to place facilities and how to distribute resources to them.",
  "p-median problem": "A problem that seeks optimal locations for a certain number of central facilities to minimize the sum of the distances between each weight and the nearest facility.",
  "Coverage problem": "A problem that seeks to minimize the furthest distance traveled by customers to a central facility.",
  "Hakimi’s theorem": "A theorem stating that only junctions (nodes) in the network and places where there is weight need to be considered when solving location-allocation problems on a network.",
  "Routing problems": "Problems involving decisions about the optimal paths for vehicles to follow.",
  "Shortest-path problem": "A problem that finds the path through a network that minimizes distance or some other measure based on distance.",
  "Traveling-salesman problem (TSP)": "A problem to select the best tour out of all possible orderings of places to visit, in order to minimize the distance traveled.",
  "Orienteering problem": "A problem similar to TSP but the objective is to maximize the rewards associated with visiting a selection of the stops while minimizing the total distance traveled.",
  "Sears": "A company whose drivers use a system to schedule and navigate their workload.",
  "Hypothesis testing": "A statistical method that uses information obtained from samples to make general conclusions about a larger population.",
  "Randomization tests": "Tests that simulate a large number of random arrangements of the data as an alternative to traditional hypothesis testing.",
  "Santa Barbara": "A city in California, north of which a randomly placed sample of points was used to examine the relationship between vegetation cover class and elevation.",
  "ArcGIS Pro": "A professional Geographic Information System (GIS) application for creating and working with spatial data on your desktop.",
  "Route": "The specific path or direction mentioned in the text. It is not clear what this refers to without further context.",
  "Quiz 4": "A test or assessment that will be administered via Quercus. It covers materials from Week 9&10 Spatial Analysis I&II and recommended readings.",
  "Quercus": "The platform through which Quiz 4 will be administered. It is likely an online learning management system.",
  "Week 9&10 Spatial Analysis I&II": "The subject matter that Quiz 4 will cover. It likely refers to the topics taught during weeks 9 and 10 of a course, specifically Spatial Analysis I and II.",
  "Recommended readings": "Additional material suggested for study in preparation for Quiz 4. The specific readings are not mentioned in the text.",
  "Lab 3": "A practical, hands-on session or experiment that is part of a course. It is scheduled for Thursday, March 13, 2025.",
  "Thursday, March 13, 2025": "The date on which Lab 3 is scheduled to take place."
}