{
  "Dr. Alex Kalynychenko": "A professor in the Department of Geography, Geomatics and Environment at the University of Toronto Mississauga who is giving a lecture on Spatial Analysis.",
  "University of Toronto Mississauga": "A campus of the University of Toronto, where Dr. Alex Kalynychenko is a professor.",
  "Spatial Analysis": "A type of geographical analysis which seeks patterns in data and how they relate to one another in space",
  "ESRI": "A company that provides geographic information system (GIS) software. The lecture includes a demo of ESRI's Spatial Analysis tools from 2023.",
  "Carl Steinitz": "A scholar known for his work in geodesign",
  "Longley et al. (2015)": "The source of a referenced schematic model of the geodesign process.",
  "ArcGIS Pro extensions": "Specifically designed extensions for the ArcGIS Pro software that allow for various types of spatial analysis, including 3D analysis, business analysis, geostatistical analysis, image analysis, network analysis, and spatial analysis.",
  "Aristotle": "A famous philosopher mentioned in the context of known vs unknown limitations.",
  "Machine learning and AI": "A set of data-driven algorithms and techniques that automate the prediction, classification, and clustering of data. Deep learning, a subset of machine learning, uses artificial neural networks to learn from data.",
  "Big data analytics": "The process of examining large and varied data sets to uncover hidden patterns, unknown correlations, market trends, customer preferences and other useful information. In the context of this text, ArcGIS Pro includes tools for big data analytics.",
  "ESRI 2024": "A source of the text, likely referring to a publication or report from the Environmental Systems Research Institute (ESRI) in the year 2024.",
  "Modeling and scripting": "A concept in computer science and GIS (Geographic Information Systems) that involves creating digital representations of real-world phenomena and automating tasks using programming languages like Python.",
  "Python": "A high-level, interpreted programming language often used in data analysis, machine learning, and GIS applications.",
  "ModelBuilder": "A visual programming language for building geoprocessing workflows in ESRI's ArcGIS software.",
  "Zandbergen (2024)": "Another source of the text, likely referring to a publication or report by an author or researcher named Zandbergen in the year 2024.",
  "Area-Based Analyses": "A concept in geography and GIS that involves studying characteristics of defined areas or regions, rather than individual points.",
  "Polygon": "In the context of GIS, a polygon is a closed shape defined by a connected sequence of coordinates or vertices. It is used to represent areas in spatial analysis.",
  "Redistricting": "The process of redrawing district boundaries, often after a census. In the U.S., this is often associated with political processes and can be influenced by gerrymandering.",
  "Gerrymandering": "The practice of manipulating the boundaries of an electoral constituency to favor one party or class.",
  "23rd Congressional District": "A former electoral district in California, USA, which was transformed into the 24th District after the 2010 U.S. census.",
  "24th District": "A Congressional District in California, USA, created after redistricting following the 2010 U.S. census.",
  "Centrality": "A concept in statistics and geography that involves measures of central tendency (mean, median, mode) and the location of the 'center' of a set of points or a distribution.",
  "Centroid": "In the context of GIS, a centroid is the geometric center of a two-dimensional shape. In the context of a set of points, it is the arithmetic mean position of all the points.",
  "U.S. Bureau of the Census": "A U.S. government agency responsible for producing data about the American people and economy, including conducting the decennial census.",
  "Dispersion": "A statistical concept that represents the degree to which a set of values is spread out. Common measures of dispersion include range, variance, and standard deviation.",
  "Standard deviation": "A measure of the amount of variation or dispersion in a set of values. A low standard deviation indicates that the values tend to be close to the mean, while a high standard deviation indicates that the values are spread out over a wider range.",
  "RMSE": "Root Mean Square Error, a measure of the differences between values predicted by a model or an estimator and the values observed.",
  "Analysis of Surfaces": "A concept in GIS that involves studying the characteristics of a surface, such as slope, aspect, and visibility, often using a Digital Elevation Model (DEM).",
  "DEM": "Digital Elevation Model, a 3D representation of a terrain's surface created from terrain elevation data.",
  "Queen’s case move set": "A concept in GIS, specifically in raster analysis, referring to a method of cell evaluation based on the eight cells surrounding the target cell, similar to the possible moves of a queen in chess.",
  "2015": "Year of the source material",
  "https://www.travelassociates.com/": "Website URL, likely related to travel or location-based information",
  "Orange County DEM": "Digital Elevation Model for Orange County, a 3D representation of a terrain's surface",
  "River channels": "Paths through which a river flows",
  "Santa Ana River": "A river in Southern California",
  "Gorge": "A narrow valley between hills or mountains",
  "Pacific": "Refers to the Pacific Ocean",
  "Seal Beach": "A coastal city in Orange County, California",
  "Newport Beach": "A coastal city in Orange County, California",
  "Geodesign": "A design and planning method which tightly couples the creation of design proposals with impact simulations informed by geographic contexts",
  "Location-allocation problems": "Optimization problems that involve determining where to place facilities and how to allocate demand",
  "p-median problem": "An optimization problem that seeks the best locations for a certain number of facilities to minimize the sum of the distances between each demand point and its assigned facility",
  "Coverage problem": "An optimization problem that seeks to minimize the maximum distance from any demand point to its assigned facility",
  "Hakimi’s theorem": "A theorem in network theory related to location-allocation problems",
  "Routing problems": "Problems that involve determining the best paths or routes, often in the context of logistics or transportation",
  "Shortest-path problem": "An optimization problem that seeks the shortest path through a network from a defined origin to a destination",
  "Traveling-salesman problem (TSP)": "An optimization problem that seeks the shortest possible route that includes a specified set of locations and returns to the origin location",
  "Orienteering problem": "An optimization problem that seeks to maximize the rewards of visiting certain locations while minimizing the total distance traveled",
  "Sears": "An American chain of department stores",
  "Hypothesis testing": "A statistical method used to make inferences or draw conclusions about a population based on a sample",
  "Randomization tests": "Statistical tests that generate many random rearrangements of the data to draw conclusions",
  "Santa Barbara": "A city in California",
  "ArcGIS Pro": "A geographic information system for working with maps and geographic information, used for creating and using maps, compiling geographic data, analyzing mapped information, sharing and discovering geographic information",
  "Quiz 4": "An assessment that will be administered via Quercus next week, covering materials of Week 9&10 Spatial Analysis I&II and recommended readings.",
  "Quercus": "The platform through which Quiz 4 will be administered.",
  "Week 9&10 Spatial Analysis I&II": "The materials that will be covered in Quiz 4, presumably related to the study of spatial analysis.",
  "Recommended readings": "Additional materials suggested for study in preparation for Quiz 4.",
  "Lab 3": "The next lab session that will take place on Thursday, March 13, 2025.",
  "Thursday, March 13, 2025": "The date on which Lab 3 is scheduled to occur."
}