{
  "Dr. Alex Kalynychenko": "A lecturer at the University of Toronto Mississauga, Department of Geography, Geomatics and Environment, who is giving a lecture on Spatial Analysis.",
  "University of Toronto Mississauga": "A campus of the University of Toronto, where Dr. Alex Kalynychenko is teaching.",
  "Department of Geography, Geomatics and Environment": "A department within the University of Toronto Mississauga, where Dr. Alex Kalynychenko is based.",
  "Spatial Analysis": "A type of geographical analysis which seeks to explain patterns of human behavior and its spatial expression in terms of mathematics and geometry, that is, locational analysis.",
  "GGR 321 H5S": "The course code for the class in which the lecture is being given.",
  "ESRI": "An international supplier of Geographic Information System software, web GIS and geodatabase management applications. They are the source of some of the lecture's content and also the provider of a demo.",
  "Carl Steinitz": "A renowned scholar in the field of geodesign.",
  "ArcGIS Pro": "A popular geographic information system (GIS) application for creating and working with spatial data on your desktop.",
  "Machine Learning": "A set of data-driven algorithms and techniques that automate the prediction, classification, and clustering of data. It is discussed in the context of spatial analysis.",
  "AI": "Artificial Intelligence, a branch of computer science dealing with the simulation of intelligent behavior in computers. It is discussed in the context of spatial analysis.",
  "Deep Learning": "A subset of machine learning techniques that uses artificial neural networks to learn from data. It is discussed in the context of spatial analysis.",
  "Big Data Analytics": "The process of examining large and varied data sets to uncover hidden patterns, unknown correlations, market trends, customer preferences and other useful information. It is discussed in the context of spatial analysis.",
  "ArcGIS Pro Extensions": "Additional tools or capabilities that can be added to the ArcGIS Pro software. They are discussed in the lecture in the context of spatial analysis.",
  "Spark": "An open-source, distributed computing system used for big data processing and analytics. It is mentioned in the context of the GeoAnalytics Desktop toolbox.",
  "GeoAnalytics Desktop Toolbox": "A set of tools in ArcGIS Pro that provides a parallel processing framework for analysis on a desktop machine using Spark.",
  "Raster Analysis Toolbox": "A set of tools in ArcGIS Pro for performing computationally intensive raster analysis on image services and other portal items.",
  "ESRI 2024": "The source of the information about modeling and scripting in geoprocessing using Python and ModelBuilder.",
  "Python": "A high-level, interpreted programming language often used in geoprocessing and scripting.",
  "ModelBuilder": "A visual programming language for building geoprocessing workflows in ESRI software.",
  "Zandbergen 2024": "The source of the information about the purpose of area-based analyses.",
  "Area-Based Analyses": "A method of simplifying geographical complexity by ascribing characteristics to entire areas rather than individual points.",
  "Polygon": "A plane figure that is described by a finite number of straight line segments connected to form a closed polygonal chain or polygonal circuit.",
  "Longley et al. (2015)": "The source of the information about redistricting, gerrymandering, centrality, and analysis of surfaces.",
  "Gerrymandering": "The practice of setting boundaries of electoral districts to favor specific political interests within legislative bodies.",
  "23rd Congressional District": "An old congressional district in California that was transformed into a more compact 24th District after the 2010 U.S. census.",
  "24th District": "A new, more compact congressional district in California that was formed after redistricting following the 2010 U.S. census.",
  "Centrality": "A statistical measure that determines the single central point and dispersion around this point in a data set.",
  "Mean": "A measure of central tendency which is calculated by adding all the data points and dividing the total by the number of data points.",
  "Median": "A measure of central tendency which separates the higher half from the lower half of a data set.",
  "Mode": "A measure of central tendency which represents the value that appears most frequently in a data set.",
  "Centroid": "The two-dimensional equivalent of the mean, often used to summarize the locations of a set of points.",
  "U. S. Bureau of the Census": "The government agency that conducts the U.S. census and provides important demographic information.",
  "Standard Deviation": "A measure of the amount of variation or dispersion in a set of values.",
  "Variance": "A measure of dispersion that represents the average of the squared differences from the Mean.",
  "RMSE": "Root Mean Square Error, a measure of the differences between values predicted by a model and the values actually observed.",
  "Analysis of Surfaces": "A process in spatial analysis and geoprocessing that involves the study of surface features and properties like slope, aspect, and visibility.",
  "DEM": "Digital Elevation Model, a 3D representation of a terrain's surface created from terrain elevation data.",
  "2015": "The year mentioned in the context of the source of the information being analyzed.",
  "https://www.travelassociates.com/": "A website URL, possibly the source of some information or related to the topic being discussed.",
  "Orange County DEM": "Digital Elevation Model of Orange County, a 3D representation of a terrain's surface.",
  "river channels": "The physical pathways through which a river flows.",
  "Santa Ana River": "A river in Southern California, United States.",
  "gorge": "A narrow valley between hills or mountains, typically with steep rocky walls and a stream running through it.",
  "Pacific": "The Pacific Ocean, the largest and deepest of Earth's oceanic divisions.",
  "Seal Beach": "A coastal city in Orange County, California, United States.",
  "Newport Beach": "A coastal city in southern California, United States.",
  "geodesign process": "A design and planning method which tightly couples the creation of design proposals with impact simulations informed by geographic contexts.",
  "location-allocation problems": "Problems that involve determining where to place facilities and how to allocate demand to them.",
  "p-median problem": "A mathematical problem that seeks to find the optimal locations for a certain number of facilities to minimize the sum of distances between each demand point and its nearest facility.",
  "coverage problem": "A mathematical problem that seeks to minimize the maximum distance from any demand point to the nearest facility.",
  "Hakimi’s theorem": "A theorem in network theory that simplifies location-allocation problems by stating that only junctions (nodes) in the network and places where there is demand need to be considered.",
  "routing problems": "Problems that involve determining the best routes for vehicles or other moving entities.",
  "shortest-path problem": "A problem that involves finding the shortest path through a network from a defined origin to a destination.",
  "traveling-salesman problem (TSP)": "A classic algorithmic problem in the field of computer science and operations research which focuses on optimization, aiming to find the shortest possible route that visits each place once and returns to the origin place.",
  "orienteering problem": "A problem similar to the TSP but with the objective to maximize the rewards associated with visiting a selection of the stops while minimizing the total distance traveled.",
  "Sears": "An American chain of department stores.",
  "hypothesis testing": "A statistical method that is used in making statistical decisions using experimental data.",
  "randomization tests": "Statistical tests that involve generating samples according to a specified null hypothesis to make general conclusions about a larger population.",
  "Santa Barbara": "A city on the central California coast, United States.",
  "route": "The path or direction mentioned in the text, context not clear enough for a specific definition.",
  "Quiz 4": "The fourth quiz or assessment in a series, to be administered via Quercus.",
  "Quercus": "An online learning management system where Quiz 4 will be administered.",
  "Week 9&10 Spatial Analysis I&II": "The ninth and tenth week's topics in a course, focusing on the first and second parts of Spatial Analysis.",
  "recommended readings": "Suggested literature or resources for better understanding of the course material.",
  "lab 3": "The third practical or hands-on session in a series, scheduled for a specific date.",
  "Thursday, March 13, 2025": "The specific date on which 'lab 3' is scheduled to occur."
}