{
  "Dr. Alex Kalynychenko": "A lecturer at the University of Toronto Mississauga, Department of Geography, Geomatics and Environment, who is presenting a lecture on Spatial Analysis.",
  "University of Toronto Mississauga": "A university campus where the lecture is taking place.",
  "Spatial Analysis": "A set of methods applied to spatial data to reveal patterns, anomalies, and solutions for complex spatial problems.",
  "ESRI": "A supplier of Geographic Information System (GIS) software, web GIS and geodatabase management applications. Their software is referenced multiple times in the lecture.",
  "Carl Steinitz": "A scholar who developed a model of the geodesign process.",
  "Longley et al. (2015)": "A source of information, likely related to GIS and spatial analysis.",
  "ArcGIS Pro extensions": "A set of extensions for the ArcGIS Pro software, designed for various types of spatial analysis, including 3D analysis, business analysis, geostatistical analysis, image analysis, network analysis, and spatial analysis.",
  "Aristotle": "An ancient Greek philosopher mentioned in the context of known and unknown limitations.",
  "Machine Learning and AI": "A set of data-driven algorithms and techniques that automate the prediction, classification, and clustering of data. Deep learning, a subset of machine learning, uses artificial neural networks to learn from data.",
  "Big Data Analytics": "The process of examining large and varied data sets to uncover hidden patterns, unknown correlations, market trends, customer preferences and other useful information. In the context of this lecture, it refers to tools in ArcGIS Pro that can transform large amounts of spatial data into manageable information.",
  "ESRI 2024": "A source of information, likely related to geographic information systems (GIS) and spatial analysis.",
  "Modeling and scripting": "A concept in GIS and programming, involving the creation of digital representations of physical or abstract systems and the use of scripts (small programs) to automate tasks.",
  "Geoprocessing framework": "The structure and methodology for performing spatial analysis and data manipulation in a GIS environment.",
  "Python scripts": "Programs written in the Python programming language, often used for automating tasks in GIS.",
  "ModelBuilder": "A visual programming language for building geoprocessing workflows in ArcGIS, a GIS software developed by ESRI.",
  "Zandbergen (2024)": "Another source of information, likely related to GIS and spatial analysis.",
  "Area-Based Analyses": "A method in GIS and spatial analysis where characteristics are ascribed to entire areas rather than individual points.",
  "Polygon": "A geometric figure with multiple sides, used in GIS to represent areas.",
  "Trapezia": "A type of geometric figure, used in the calculation of area in this context.",
  "Redistricting": "The process of redrawing district boundaries, often after a census.",
  "Gerrymandering": "The practice of manipulating the boundaries of an electoral constituency to favor a particular party or class.",
  "Centrality": "A concept in spatial analysis referring to the central point or location of a set of points.",
  "Mean, median, mode": "Statistical measures of central tendency.",
  "Centroid or mean center": "The average location of a set of points in a two-dimensional space.",
  "U. S. Bureau of the Census": "A government agency responsible for conducting the U.S. Census.",
  "Dispersion": "A statistical concept referring to the spread of a set of values.",
  "Standard deviation": "A measure of the amount of variation or dispersion in a set of values.",
  "Variance": "A statistical measurement of the spread between numbers in a data set.",
  "RMSE": "Root Mean Square Error, a measure of the differences between values predicted by a model and the values actually observed.",
  "Analysis of Surfaces": "A method in GIS involving the study of surface features and characteristics.",
  "Slope and aspect": "Geographic attributes of a surface, where slope is the steepness or gradient of a surface and aspect is the compass direction that a slope faces.",
  "DEM": "Digital Elevation Model, a 3D representation of a terrain's surface.",
  "2015": "The year in which the sources for the text were published.",
  "https://www.travelassociates.com/": "Website URL mentioned in the text, likely related to travel or location-based services.",
  "Orange County DEM": "Digital Elevation Model of Orange County, a 3D representation of a terrain's surface.",
  "river channels": "Paths through which a river flows.",
  "Santa Ana River": "A river in Southern California that flows from the San Bernardino Mountains to the Pacific Ocean.",
  "gorge": "A narrow valley between hills or mountains, typically with steep rocky walls and a stream running through it.",
  "Pacific": "The Pacific Ocean, where the Santa Ana River empties.",
  "Seal Beach": "A coastal city in Orange County, California, where the Santa Ana River is initially thought to empty.",
  "Newport Beach": "A coastal city in Orange County, California, where the Santa Ana River actually empties.",
  "geodesign principles": "Principles used in the field of geodesign, which combines geography with design.",
  "location-allocation problems": "Problems that involve determining where to place facilities and how to distribute resources.",
  "p-median problem": "An optimization problem that seeks to find the best locations for a certain number of facilities to minimize distance.",
  "coverage problem": "An optimization problem that seeks to minimize the furthest distance traveled to a facility.",
  "Hakimi’s theorem": "A theorem in network theory that simplifies location-allocation problems by considering only certain points in the network.",
  "routing problems": "Problems that involve determining the optimal paths for vehicles or other entities to follow.",
  "shortest-path problem": "A problem that seeks to find the shortest path between two points in a network.",
  "traveling-salesman problem (TSP)": "An optimization problem that seeks to determine the shortest possible route that visits a selection of locations and returns to the origin.",
  "orienteering problem": "An optimization problem similar to TSP, but with the goal of maximizing rewards while minimizing distance traveled.",
  "Sears": "A retail company whose drivers' scheduling and navigation system is mentioned.",
  "hypothesis testing": "A statistical method used to make inferences or generalizations about a larger population based on a sample.",
  "randomization tests": "Statistical tests that use random arrangements of data to draw conclusions.",
  "Santa Barbara": "A city in California, north of which a sample of points is used to examine the relationship between vegetation cover class and elevation.",
  "ArcGIS Pro": "A professional Geographic Information System (GIS) application for creating and working with spatial data.",
  "Quiz 4": "An assessment that will be administered via Quercus next week, covering materials from Week 9&10 Spatial Analysis I&II and recommended readings.",
  "Quercus": "The platform through which Quiz 4 will be administered.",
  "Week 9&10 Spatial Analysis I&II": "The materials that will be covered in Quiz 4, presumably part of a course or study program.",
  "Recommended readings": "Additional materials suggested for study in preparation for Quiz 4.",
  "Lab 3": "The next lab session, scheduled for Thursday, March 13, 2025.",
  "Thursday, March 13, 2025": "The date on which Lab 3 will take place."
}