{
  "Dr. Alex Kalynychenko": "A lecturer at the Department of Geography, Geomatics and Environment, University of Toronto Mississauga, who is presenting the lecture on Spatial Analysis.",
  "University of Toronto Mississauga": "A university campus where the lecture on Spatial Analysis is being presented.",
  "Spatial Analysis": "A powerful set of methods that can be applied to spatial data to add value to them, reveal patterns and anomalies, find solutions for complex spatial problems and support decision-making.",
  "ESRI": "A company that provides geographic information system (GIS) software. In the text, it is mentioned as the source of a demo and various tools for spatial analysis.",
  "Carl Steinitz": "A person who developed a schematic model of the geodesign process.",
  "Longley et al. (2015)": "A source of the text, possibly a publication or report by an author named Longley and others in the year 2015.",
  "ArcGIS Pro extensions": "Special tools designed for various spatial analysis tasks, including 3D analysis, market trend analysis, prediction of spatial phenomena, imagery interpretation, network analysis, and more.",
  "Machine learning and AI": "Data-driven algorithms and techniques that automate the prediction, classification, and clustering of data. Deep learning, a subset of machine learning, uses artificial neural networks to learn from data.",
  "Big data analytics": "The process of examining large and varied data sets to uncover hidden patterns, unknown correlations, market trends, customer preferences and other useful information. In the context of the text, it refers to tools in ArcGIS Pro that transform large amounts of spatial data into manageable information.",
  "ESRI 2024": "A source of the text, possibly a publication or report from the Environmental Systems Research Institute (ESRI) in the year 2024.",
  "Modeling and scripting": "A concept in programming and data analysis that involves creating mathematical or computational representations of systems and automating tasks or processes.",
  "Geoprocessing framework": "A set of tools and functionalities in GIS software that allows for the manipulation and analysis of geographic data.",
  "Python scripts": "Programs written in Python, a high-level programming language, often used for automating tasks and data analysis.",
  "ModelBuilder": "A visual programming language for building geoprocessing workflows in ESRI's ArcGIS software.",
  "Zandbergen (2024)": "Another source of the text, possibly a publication or report by an author named Zandbergen in the year 2024.",
  "Area-Based Analyses": "A method of geographical analysis that involves assigning characteristics to entire areas rather than individual points.",
  "Polygon": "In the context of the text, a shape with multiple sides used in geographic analysis to represent areas.",
  "Redistricting": "The process of redrawing electoral district boundaries, often after a census.",
  "Gerrymandering": "The practice of manipulating the boundaries of an electoral constituency to favor one party or class.",
  "23rd Congressional District and 24th District": "Specific electoral districts in the United States, mentioned in the context of redistricting.",
  "Centrality": "A concept in geographic analysis referring to the central point or location in a set of points or area.",
  "Mean, median, and mode": "Statistical measures of central tendency, used to summarize a set of values.",
  "Centroid or mean center": "The average location of a set of points in two-dimensional space.",
  "U. S. Bureau of the Census": "The U.S. government agency responsible for conducting the national census and providing statistical information about the U.S. population.",
  "Dispersion": "A statistical concept referring to the spread of values in a dataset.",
  "Standard deviation and variance": "Statistical measures of dispersion, indicating how spread out the values in a dataset are from the mean.",
  "RMSE": "Root Mean Square Error, a measure of the differences between values predicted by a model and the values actually observed.",
  "Analysis of Surfaces": "A concept in geographic analysis that involves studying the characteristics and features of a geographical surface.",
  "Slope and aspect": "Characteristics of a geographical surface, indicating its steepness and orientation respectively.",
  "DEM": "Digital Elevation Model, a digital representation of ground surface topography or terrain.",
  "Queen’s case move set": "A concept in spatial analysis referring to the eight possible movements of a queen in a chess game, used to model movement or flow in a two-dimensional space.",
  "Watersheds and channels": "Geographical features related to water flow, where a watershed is an area of land that drains all the streams and rainfall to a common outlet, and channels are the pathways through which the water flows.",
  "Orange County DEM": "A Digital Elevation Model (DEM) of Orange County, used to predict river channels.",
  "Santa Ana River": "A river that flows out of a gorge and into the Pacific near Seal Beach, but in reality, it turns south and empties near Newport Beach.",
  "Seal Beach": "A location near where the Santa Ana River is predicted to empty into the Pacific.",
  "Newport Beach": "The actual location where the Santa Ana River empties into the Pacific.",
  "Geodesign": "A design and planning method which tightly couples the creation of design proposals with impact simulations informed by geographic contexts.",
  "Location-allocation problems": "Problems which involve determining where to locate and how to allocate demand to central facilities.",
  "p-median problem": "A problem that seeks optimum locations for any number of central facilities such that the sum of the distances between each weight and the nearest facility is minimized.",
  "coverage problem": "A problem that seeks to minimize the furthest distance traveled by point locations.",
  "Hakimi’s theorem": "A theorem stating that only junctions (nodes) in the network and places where there is weight need to be considered in certain location-allocation problems.",
  "Routing problems": "Problems involving decisions about the optimum tracks followed by vehicles.",
  "shortest-path problem": "A problem that finds the path through the network between a defined origin and destination that minimizes distance or some other measure based on distance.",
  "traveling-salesman problem (TSP)": "A problem to select the best tour out of all possible orderings of places to visit, in order to minimize the distance (or other measure) traveled.",
  "orienteering problem": "A problem similar to TSP but the objective is to maximize the rewards associated with visiting a selection of the stops while minimizing the total distance traveled.",
  "Hypothesis testing": "A statistical method which uses information obtained from samples to make general conclusions about a larger population.",
  "randomization tests": "Tests which simulate a large number of random arrangements of the data as an alternative to traditional hypothesis testing.",
  "ArcGIS Pro": "A professional Geographic Information System (GIS) application for creating and working with spatial data on your desktop.",
  "Quiz 4": "A scheduled assessment that will be administered via Quercus, covering materials of Week 9&10 Spatial Analysis I&II and recommended readings.",
  "Quercus": "The platform through which Quiz 4 will be administered.",
  "Week 9&10 Spatial Analysis I&II": "The materials that will be covered in Quiz 4. This likely refers to content taught during weeks 9 and 10 of a course, specifically related to spatial analysis.",
  "Recommended readings": "Additional materials suggested for study in preparation for Quiz 4.",
  "Lab 3": "The third lab session of a course, scheduled for Thursday, March 13, 2025.",
  "Thursday, March 13, 2025": "The date on which Lab 3 is scheduled to occur."
}