{
  "Dr. Alex Kalynychenko": "A lecturer at the University of Toronto Mississauga, Department of Geography, Geomatics and Environment, who is delivering a lecture on Spatial Analysis.",
  "University of Toronto Mississauga": "A campus of the University of Toronto, where the lecture on Spatial Analysis is taking place.",
  "Department of Geography, Geomatics and Environment": "The department at the University of Toronto Mississauga where Dr. Alex Kalynychenko works.",
  "Spatial Analysis": "A set of methods applied to spatial data to reveal patterns and anomalies, find solutions for complex spatial problems, and support decision-making.",
  "ESRI": "Environmental Systems Research Institute, a supplier of geographic information system software, web GIS and geodatabase management applications. The source of some of the lecture's content.",
  "Carl Steinitz": "A person who developed a schematic model of the geodesign process.",
  "Longley et al. (2015)": "A source of information, possibly a publication or event, related to the field of GIS.",
  "ArcGIS Pro": "A professional Geographic Information System (GIS) application for creating and working with spatial data on your desktop.",
  "Machine Learning": "A set of data-driven algorithms and techniques that automate the prediction, classification, and clustering of data.",
  "AI": "Artificial Intelligence, the simulation of human intelligence processes by machines, especially computer systems.",
  "Deep Learning": "A subset of machine learning techniques that uses artificial neural networks to learn from data.",
  "Big Data Analytics": "The process of examining large and varied data sets to uncover hidden patterns, unknown correlations, market trends, customer preferences and other useful information.",
  "ESRI 2024": "A source of information, possibly a publication or event, related to the field of geographic information systems (GIS).",
  "Modeling and scripting": "A process involving the creation of models (representations of systems) and scripts (automated sequences of instructions) for various purposes, such as geoprocessing in GIS.",
  "Python": "A high-level, interpreted programming language often used for scripting in various fields, including GIS.",
  "ModelBuilder": "A visual programming language for building geoprocessing workflows in ArcGIS, a software developed by ESRI.",
  "Zandbergen (2024)": "Another source of information, possibly a publication or event, related to the field of GIS.",
  "Area-Based Analyses": "A method of analysis in GIS that involves assigning characteristics to entire areas rather than individual points.",
  "Polygon": "In the context of GIS, a polygon is a plane figure that is described by a finite number of straight line segments connected to form a closed polygonal chain or polygonal circuit.",
  "Redistricting": "The process of drawing electoral district boundaries in the United States.",
  "Gerrymandering": "A practice intended to establish an unfair political advantage for a particular party or group by manipulating district boundaries.",
  "23rd Congressional District": "A former congressional district in the United States, which was transformed into the 24th District after the 2010 U.S. census.",
  "24th District": "A congressional district in the United States, which was formed from the old 23rd Congressional District after the 2010 U.S. census.",
  "Centrality": "A concept in GIS that refers to the measure of central tendency including mean, median, and mode.",
  "Centers": "The two-dimensional equivalent of the mean in GIS.",
  "Centroid or mean center": "The most convenient way of summarizing the locations of a set of points in GIS, found by taking the weighted average of the x and y coordinates.",
  "U. S. Bureau of the Census": "A part of the U.S. Federal Statistical System responsible for producing data about the American people and economy.",
  "Dispersion": "A measure of how much a set of values is spread out in statistics.",
  "Standard deviation": "A measure of the amount of variation or dispersion of a set of values.",
  "Variance": "The expectation of the squared deviation of a random variable from its mean.",
  "RMSE": "Root Mean Square Error, a frequently used measure of the differences between values predicted by a model or an estimator and the values observed.",
  "Analysis of Surfaces": "A method in GIS that involves the study of surface features and attributes.",
  "Slope and aspect": "In GIS, slope is the degree of steepness or the degree of deviation from a horizontal surface, and aspect is the compass direction that a slope faces.",
  "DEM": "Digital Elevation Model, a 3D representation of a terrain's surface.",
  "2015": "The year of publication for the sources referenced in the text.",
  "https://www.travelassociates.com/": "The URL of a website mentioned in the text, likely related to travel or location-based analysis.",
  "Orange County DEM": "Digital Elevation Model of Orange County, a 3D representation of a terrain's surface used for hydrologic analysis.",
  "river channels": "Paths through which a river flows, identified in red in the context.",
  "Santa Ana River": "A river in California that flows out of a gorge and towards the Pacific Ocean.",
  "Seal Beach": "A coastal city in California where the Santa Ana River is initially thought to empty into the Pacific Ocean.",
  "Newport Beach": "A coastal city in California where the Santa Ana River actually empties into the Pacific Ocean.",
  "geodesign process": "A method developed by Carl Steinitz for practical applications of geodesign principles.",
  "location-allocation problems": "Problems that involve determining where to place and how to distribute demand to central facilities.",
  "p-median problem": "A problem that seeks optimal locations for a certain number of central facilities to minimize the sum of the distances between each weight and the nearest facility.",
  "coverage problem": "A problem that seeks to minimize the furthest distance traveled by point locations.",
  "Hakimi’s theorem": "A theorem stating that only junctions (nodes) in the network and places where there is weight need to be considered in certain location-allocation problems.",
  "routing problems": "Problems that involve decisions about the optimum tracks followed by vehicles.",
  "shortest-path problem": "A problem that finds the path through the network between a defined origin and destination that minimizes distance or some other measure based on distance.",
  "traveling-salesman problem (TSP)": "A problem that seeks to select the best tour out of all possible orderings of places to visit, in order to minimize the distance traveled.",
  "orienteering problem": "A problem that seeks to maximize the rewards associated with visiting a selection of the stops while minimizing the total distance traveled.",
  "Sears": "A retail company mentioned in the context of a system used by drivers to schedule and navigate a day’s workload.",
  "hypothesis testing": "A statistical method that uses information obtained from samples to make general conclusions about a larger population.",
  "randomization tests": "Tests that simulate a large number of random arrangements of the data as an alternative to traditional hypothesis testing.",
  "Santa Barbara": "A city in California mentioned in the context of a sample of points used to examine the relationship between vegetation cover class and elevation.",
  "Quiz 4": "An upcoming assessment to be administered via Quercus, covering materials of Week 9&10 Spatial Analysis I&II and recommended readings.",
  "Quercus": "The platform through which Quiz 4 will be administered.",
  "Week 9&10 Spatial Analysis I&II": "The topics that will be covered in Quiz 4. These topics are related to spatial analysis.",
  "Recommended readings": "Additional materials suggested for study and preparation for Quiz 4.",
  "Lab 3": "The next lab session, scheduled for Thursday, March 13, 2025.",
  "Thursday, March 13, 2025": "The date on which Lab 3 is scheduled."
}