{
  "Dr. Alex Kalynychenko": "A lecturer at the University of Toronto Mississauga, teaching a course on Geographic Information Processing.",
  "University of Toronto Mississauga": "A campus of the University of Toronto, where Dr. Alex Kalynychenko is teaching.",
  "Department of Geography, Geomatics and Environment": "The department at the University of Toronto Mississauga where Dr. Alex Kalynychenko works.",
  "GGR 321 H5S": "The course code for the Geographic Information Processing course taught by Dr. Alex Kalynychenko.",
  "Spatial Analysis": "A set of methods used to analyze spatial data, revealing patterns, anomalies, and solutions to complex spatial problems.",
  "ESRI": "A company that provides geographic information system software, web GIS and geodatabase management applications. They are mentioned as the source of some course materials and as the developers of the ArcGIS Pro extensions.",
  "ArcGIS Pro extensions": "A set of tools provided by ESRI for various types of spatial analysis, including 3D analysis, business analysis, geostatistical analysis, image analysis, network analysis, and spatial analysis.",
  "Carl Steinitz": "A scholar known for his work in geodesign, a field that combines geography with design.",
  "Machine learning": "A set of data-driven algorithms and techniques that automate the prediction, classification, and clustering of data.",
  "Deep learning": "A subset of machine learning techniques that uses artificial neural networks to learn from data.",
  "Big data analytics": "The process of examining large and varied data sets to uncover hidden patterns, unknown correlations, market trends, customer preferences and other useful information. In the context of this text, it refers to tools in ArcGIS Pro that can transform large amounts of spatial data into manageable information.",
  "ESRI 2024": "A source of information about geoprocessing framework and Python scripting in the context of modeling.",
  "Python": "A high-level, interpreted programming language often used in geoprocessing and modeling.",
  "ModelBuilder": "A visual programming language for building geoprocessing workflows, often used in tandem with Python.",
  "Zandbergen (2024)": "A source of information about area-based analyses and the simplification of Earth's geography.",
  "Area-Based Analyses": "A method of simplifying the Earth's complexity by ascribing characteristics to entire areas rather than individual points.",
  "Polygon": "A plane figure that is bounded by a finite chain of straight line segments closing in a loop to form a closed chain or circuit.",
  "Longley et al. (2015)": "A source of information about area-based analyses, measurement of shape, redistricting, gerrymandering, and centrality.",
  "Redistricting": "The process of drawing electoral district boundaries in the United States.",
  "Gerrymandering": "A practice intended to establish an unfair political advantage for a particular party or group by manipulating district boundaries.",
  "23rd Congressional District": "A former electoral district in California, transformed into a more compact 24th District after the 2010 U.S. census.",
  "Centrality": "A concept in spatial analysis that involves several numerical measures of central tendency including mean, median, and mode.",
  "Centroid": "The two-dimensional equivalent of the mean, summarizing the locations of a set of points.",
  "U. S. Bureau of the Census": "The government agency that produces data about the American people and economy, responsible for the census.",
  "Standard Deviation": "A measure of the amount of variation or dispersion of a set of values.",
  "Variance": "The expectation of the squared deviation of a random variable from its mean.",
  "RMSE": "Root Mean Square Error, a measure of the differences between values predicted by a model or an estimator and the values observed.",
  "Analysis of Surfaces": "A method of understanding and modeling geographical features such as slope, aspect, watersheds, and channels.",
  "DEM": "Digital Elevation Model, a 3D representation of a terrain's surface.",
  "2015": "The year of the source material referenced throughout the text.",
  "https://www.travelassociates.com/": "Website URL mentioned in the text, presumably related to the source or topic of discussion.",
  "Orange County DEM": "Digital Elevation Model of Orange County, a 3D representation of a terrain's surface.",
  "River Channels": "Paths through which a river flows or used to flow.",
  "Santa Ana River": "A river in Southern California that flows from the San Bernardino mountains to the Pacific Ocean.",
  "Seal Beach": "A coastal city located in Orange County, California, where the Santa Ana River is initially thought to empty into the Pacific.",
  "Newport Beach": "A coastal city in Southern California, where the Santa Ana River actually empties into the Pacific.",
  "Geodesign Process": "A method developed by Carl Steinitz for applying geodesign principles in practical applications.",
  "Location-allocation problems": "Problems in spatial analysis that involve determining optimal locations for facilities and how to distribute demand to these facilities.",
  "p-median problem": "A location-allocation problem that seeks to minimize the sum of the distances between each demand point and the nearest facility.",
  "Coverage problem": "A location-allocation problem that seeks to minimize the furthest distance traveled by any demand point to a facility.",
  "Hakimi’s theorem": "A theorem in network analysis stating that optimal locations for facilities are at network nodes or places where there is demand.",
  "Routing problems": "Problems in spatial analysis that involve determining optimal paths or routes, often for vehicles.",
  "Shortest-path problem": "A routing problem that seeks to find the shortest path through a network from a defined origin to a destination.",
  "Traveling-salesman problem (TSP)": "A routing problem that seeks to find the shortest possible route that visits a given set of locations and returns to the origin.",
  "Orienteering problem": "A routing problem that seeks to maximize the rewards associated with visiting a selection of stops while minimizing the total distance traveled.",
  "Sears": "A retail company, mentioned in the context of a system used by its drivers for scheduling and navigation.",
  "Hypothesis testing": "A statistical method for making inferences or conclusions about a larger population based on a sample.",
  "Randomization tests": "Statistical tests that use random permutations of the data to derive significance or test hypotheses.",
  "Santa Barbara": "A city in California, mentioned in the context of a sample study examining the relationship between vegetation cover class and elevation.",
  "ArcGIS Pro": "A professional Geographic Information System (GIS) application for creating and working with spatial data.",
  "Quiz 4": "An assessment that will be administered via Quercus next week, covering materials of Week 9&10 Spatial Analysis I&II and recommended readings.",
  "Quercus": "The platform through which Quiz 4 will be administered.",
  "Week 9&10 Spatial Analysis I&II": "The material that Quiz 4 will be covering, presumably part of a course or study program.",
  "Recommended readings": "Additional materials suggested for study in preparation for Quiz 4.",
  "Lab 3": "The next laboratory session or practical class that is scheduled for Thursday, March 13, 2025.",
  "Thursday, March 13, 2025": "The date on which Lab 3 will take place."
}